TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
} HSADC0_ADC_LITE_RESULT_REGS_Regs;

/*@}*/ /* end of group HSADC0_ADC_LITE_RESULT_REGS */

/** @addtogroup HSADC0_ADC_LITE_REGS
  @{
*/

typedef struct {
       uint32_t RESERVED0[1024];
  HSADC0_ADC_LITE_REGS_Regs  ADC_LITE_REGS;                     /* !< (@ 0x00001000) */
  union {
      __IO uint32_t ADCCTL1_LITE_;                     /* !< ADC Control 1 Register */
      __IO uint32_t ADCCTL1_LITE__ADCCTL1_1;           /* !< ADC Control 1 Register */
  };
  union {
      __IO uint32_t ADCCTL2_LITE_;                     /* !< ADC Control 2 Register */
      __IO uint32_t ADCCTL2_LITE__ADCCTL2_1;           /* !< ADC Control 2 Register */
  };
  __IO uint32_t Reserved_5;                        /* !< (@ 0x00001008) */
  union {
      __IO uint32_t ADCBURSTCTL_LITE_;                 /* !< ADC Burst Control Register */
      __IO uint32_t ADCBURSTCTL_LITE__ADCBURSTCTL_1;   /* !< ADC Burst Control Register */
  };
  union {
      __IO uint32_t ADCINTSEL_M33_;                    /* !< ADC Interrupt 1, 2, 3 and 4 Selection Register */
      __IO uint32_t ADCINTSEL_M33__ADCINTSEL_1;        /* !< ADC Interrupt 1, 2, 3 and 4 Selection Register */
  };
  union {
      __IO uint32_t ADCDMAINTSEL_M33_;                 /* !< ADC DMA Interrupt 1, 2, 3 and 4 Selection Register */
      __IO uint32_t ADCDMAINTSEL_M33__ADCDMAINTSEL_1;  /* !< ADC DMA Interrupt 1, 2, 3 and 4 Selection Register */
  };
  union {
      __IO uint32_t ADCRAWINTFLG_4INT;                 /* !< ADC Raw Interrupt Flag Register */
      __IO uint32_t ADCRAWINTFLG_4INT_ADCRAWINTFLG_1;  /* !< ADC Raw Interrupt Flag Register */
  };
  union {
      __IO uint32_t ADCINTFLG_4INT;                    /* !< ADC Interrupt Flag Register */
      __IO uint32_t ADCINTFLG_4INT_ADCINTFLG_1;        /* !< ADC Interrupt Flag Register */
  };
  union {
      __IO uint32_t ADCINTFLGFRC_4INT;                 /* !< ADC Interrupt Flag Force Register */
      __IO uint32_t ADCINTFLGFRC_4INT_ADCINTFLGFRC_1;  /* !< ADC Interrupt Flag Force Register */
  };
  union {
      __IO uint32_t ADCINTFLGCLR_4INT;                 /* !< ADC Interrupt Flag Clear Register */
      __IO uint32_t ADCINTFLGCLR_4INT_ADCINTFLGCLR_1;  /* !< ADC Interrupt Flag Clear Register */
  };
  union {
      __IO uint32_t ADCINTOVF_4INT;                    /* !< ADC Interrupt Overflow Register */
      __IO uint32_t ADCINTOVF_4INT_ADCINTOVF_1;        /* !< ADC Interrupt Overflow Register */
  };
  union {
      __IO uint32_t ADCINTOVFCLR_4INT;                 /* !< ADC Interrupt Overflow Clear Register */
      __IO uint32_t ADCINTOVFCLR_4INT_ADCINTOVFCLR_1;  /* !< ADC Interrupt Overflow Clear Register */
  };
  union {
      __IO uint32_t ADCSOCPRICTL_LITE_;                /* !< ADC SOC Priority Control Register */
      __IO uint32_t ADCSOCPRICTL_LITE__ADCSOCPRICTL_1; /* !< ADC SOC Priority Control Register */
  };
  union {
      __IO uint32_t ADCINTSOCSEL1_LITE_;               /* !< ADC Interrupt SOC Selection 1 Register */
      __IO uint32_t ADCINTSOCSEL1_LITE__ADCINTSOCSEL1_1;/* !< ADC Interrupt SOC Selection 1 Register */
  };
  union {
      __IO uint32_t ADCINTSOCSEL2_TYPE5P0_;            /* !< ADC Interrupt SOC Selection 2 Register */
      __IO uint32_t ADCINTSOCSEL2_TYPE5P0__ADCINTSOCSEL2_1;/* !< ADC Interrupt SOC Selection 2 Register */
  };
  union {
      __IO uint32_t ADCSOCFLG1_LITE;                   /* !< ADC SOC Flag 1 Register */
      __IO uint32_t ADCSOCFLG1_LITE_ADCSOCFLG1_1;      /* !< ADC SOC Flag 1 Register */
  };
  union {
      __IO uint32_t ADCSOCFLG1_LITE_FRC;               /* !< ADC SOC Force 1 Register */
      __IO uint32_t ADCSOCFLG1_LITE_FRC_ADCSOCFRC1_1;  /* !< ADC SOC Force 1 Register */
  };
  union {
      __IO uint32_t ADCSOCOVF1_M33_;                   /* !< ADC SOC Overflow 1 Register */
      __IO uint32_t ADCSOCOVF1_M33__ADCSOCOVF1_1;      /* !< ADC SOC Overflow 1 Register */
  };
  union {
      __IO uint32_t ADCSOCOVF1_LITE_CLR;               /* !< ADC SOC Overflow Clear 1 Register */
      __IO uint32_t ADCSOCOVF1_LITE_CLR_ADCSOCOVFCLR1_1;/* !< ADC SOC Overflow Clear 1 Register */
  };
  union {
      __IO uint32_t ADCSOC0CTL_M33_;                   /* !< ADC SOC0 Control Register */
      __IO uint32_t ADCSOC0CTL_M33__ADCSOC0CTL_1;      /* !< ADC SOC0 Control Register */
  };
  union {
      __IO uint32_t ADCSOC1CTL_M33_;                   /* !< ADC SOC1 Control Register */
      __IO uint32_t ADCSOC1CTL_M33__ADCSOC1CTL_1;      /* !< ADC SOC1 Control Register */
  };
  union {
      __IO uint32_t ADCSOC2CTL_M33_;                   /* !< ADC SOC2 Control Register */
      __IO uint32_t ADCSOC2CTL_M33__ADCSOC2CTL_1;      /* !< ADC SOC2 Control Register */
  };
  union {
      __IO uint32_t ADCSOC3CTL_M33_;                   /* !< ADC SOC3 Control Register */
      __IO uint32_t ADCSOC3CTL_M33__ADCSOC3CTL_1;      /* !< ADC SOC3 Control Register */
  };
  union {
      __IO uint32_t ADCSOC4CTL_M33_;                   /* !< ADC SOC4 Control Register */
      __IO uint32_t ADCSOC4CTL_M33__ADCSOC4CTL_1;      /* !< ADC SOC4 Control Register */
  };
  union {
      __IO uint32_t ADCSOC5CTL_M33_;                   /* !< ADC SOC5 Control Register */
      __IO uint32_t ADCSOC5CTL_M33__ADCSOC5CTL_1;      /* !< ADC SOC5 Control Register */
  };
  union {
      __IO uint32_t ADCSOC6CTL_M33_;                   /* !< ADC SOC6 Control Register */
      __IO uint32_t ADCSOC6CTL_M33__ADCSOC6CTL_1;      /* !< ADC SOC6 Control Register */
  };
  union {
      __IO uint32_t ADCSOC7CTL_M33_;                   /* !< ADC SOC7 Control Register */
      __IO uint32_t ADCSOC7CTL_M33__ADCSOC7CTL_1;      /* !< ADC SOC7 Control Register */
  };
  union {
      __IO uint32_t ADCSOC8CTL_M33_;                   /* !< ADC SOC8 Control Register */
      __IO uint32_t ADCSOC8CTL_M33__ADCSOC8CTL_1;      /* !< ADC SOC8 Control Register */
  };
  union {
      __IO uint32_t ADCSOC9CTL_M33_;                   /* !< ADC SOC9 Control Register */
      __IO uint32_t ADCSOC9CTL_M33__ADCSOC9CTL_1;      /* !< ADC SOC9 Control Register */
  };
  union {
      __IO uint32_t ADCSOC10CTL_M33_;                  /* !< ADC SOC10 Control Register */
      __IO uint32_t ADCSOC10CTL_M33__ADCSOC10CTL_1;    /* !< ADC SOC10 Control Register */
  };
  union {
      __IO uint32_t ADCSOC11CTL_M33_;                  /* !< ADC SOC11 Control Register */
      __IO uint32_t ADCSOC11CTL_M33__ADCSOC11CTL_1;    /* !< ADC SOC11 Control Register */
  };
  union {
      __IO uint32_t ADCSOC12CTL_M33_;                  /* !< ADC SOC12 Control Register */
      __IO uint32_t ADCSOC12CTL_M33__ADCSOC12CTL_1;    /* !< ADC SOC12 Control Register */
  };
  union {
      __IO uint32_t ADCSOC13CTL_M33_;                  /* !< ADC SOC13 Control Register */
      __IO uint32_t ADCSOC13CTL_M33__ADCSOC13CTL_1;    /* !< ADC SOC13 Control Register */
  };
  union {
      __IO uint32_t ADCSOC14CTL_M33_;                  /* !< ADC SOC14 Control Register */
      __IO uint32_t ADCSOC14CTL_M33__ADCSOC14CTL_1;    /* !< ADC SOC14 Control Register */
  };
  union {
      __IO uint32_t ADCSOC15CTL_M33_;                  /* !< ADC SOC15 Control Register */
      __IO uint32_t ADCSOC15CTL_M33__ADCSOC15CTL_1;    /* !< ADC SOC15 Control Register */
  };
  __IO uint32_t Reserved_6[16];                    /* !< (@ 0x0000108C) */
  union {
      __IO uint32_t ADCEVTSTAT_4PPB_;                  /* !< ADC Event Status Register */
      __IO uint32_t ADCEVTSTAT_4PPB__ADCEVTSTAT_1;     /* !< ADC Event Status Register */
  };
  union {
      __IO uint32_t ADCEVTCLR_4PPB_;                   /* !< ADC Event Clear Register */
      __IO uint32_t ADCEVTCLR_4PPB__ADCEVTCLR_1;       /* !< ADC Event Clear Register */
  };
  union {
      __IO uint32_t ADCEVTSEL_4PPB_;                   /* !< ADC Event Selection Register */
      __IO uint32_t ADCEVTSEL_4PPB__ADCEVTSEL_1;       /* !< ADC Event Selection Register */
  };
  union {
      __IO uint32_t ADCEVTINTSEL_4PPB_;                /* !< ADC Event Interrupt Selection Register */
      __IO uint32_t ADCEVTINTSEL_4PPB__ADCEVTINTSEL_1; /* !< ADC Event Interrupt Selection Register */
  };
  union {
      __IO uint32_t ADCOSDETECT_HSADC12B_;             /* !< ADC Open and Shorts Detect Register */
      __IO uint32_t ADCOSDETECT_HSADC12B__ADCOSDETECT_1;/* !< ADC Open and Shorts Detect Register */
  };
  __IO uint32_t Reserved_7;                        /* !< (@ 0x000010E0) */
  union {
      __IO uint32_t ADCREV_HSADC12B_;                  /* !< ADC Revision Register */
      __IO uint32_t ADCREV_HSADC12B__ADCREV_1;         /* !< ADC Revision Register */
  };
  union {
      __IO uint32_t ADCOFFTRIM_LITE_;                  /* !< ADC Offset Trim Register 1 */
      __IO uint32_t ADCOFFTRIM_LITE__ADCOFFTRIM_1;     /* !< ADC Offset Trim Register 1 */
  };
  __IO uint32_t Reserved_8;                        /* !< (@ 0x000010EC) */
  union {
      __IO uint32_t ADCCONFIG_12B_;                    /* !< ADC Config Register */
      __IO uint32_t ADCCONFIG_12B__ADCCONFIG_1;        /* !< ADC Config Register */
  };
  __IO uint32_t Reserved_9[3];                     /* !< (@ 0x000010F4) */
  union {
      __IO uint32_t ADCPPB1CONFIG_M33_;                /* !< ADC PPB1 Config Register */
      __IO uint32_t ADCPPB1CONFIG_M33__ADCPPB1CONFIG_1;/* !< ADC PPB1 Config Register */
  };
  __IO uint32_t Reserved_10;                       /* !< (@ 0x00001104) */
  union {
      __IO uint32_t ADCPPB1OFFCAL_LITE_;               /* !< ADC PPB1 Offset Calibration Register */
      __IO uint32_t ADCPPB1OFFCAL_LITE__ADCPPB1OFFCAL_1;/* !< ADC PPB1 Offset Calibration Register */
  };
  union {
      __IO uint32_t ADCPPB1OFFREF_LITE_;               /* !< ADC PPB1 Offset Reference Register */
      __IO uint32_t ADCPPB1OFFREF_LITE__ADCPPB1OFFREF_1;/* !< ADC PPB1 Offset Reference Register */
  };
  union {
      __IO uint32_t ADCPPB1TRIPHI_LITE_;               /* !< ADC PPB1 Trip High Register */
      __IO uint32_t ADCPPB1TRIPHI_LITE__ADCPPB1TRIPHI_1;/* !< ADC PPB1 Trip High Register */
  };
  union {
      __IO uint32_t ADCPPB1TRIPLO_LITE_;               /* !< ADC PPB1 Trip Low/Trigger Time Stamp Register */
      __IO uint32_t ADCPPB1TRIPLO_LITE__ADCPPB1TRIPLO_1;/* !< ADC PPB1 Trip Low/Trigger Time Stamp Register */
  };
  __IO uint32_t Reserved_11[2];                    /* !< (@ 0x00001118) */
  union {
      __IO uint32_t ADCPPB2CONFIG_M33_;                /* !< ADC PPB2 Config Register */
      __IO uint32_t ADCPPB2CONFIG_M33__ADCPPB2CONFIG_1;/* !< ADC PPB2 Config Register */
  };
  __IO uint32_t Reserved_12;                       /* !< (@ 0x00001124) */
  union {
      __IO uint32_t ADCPPB2OFFCAL_LITE_;               /* !< ADC PPB2 Offset Calibration Register */
      __IO uint32_t ADCPPB2OFFCAL_LITE__ADCPPB2OFFCAL_1;/* !< ADC PPB2 Offset Calibration Register */
  };
  union {
      __IO uint32_t ADCPPB2OFFREF_LITE_;               /* !< ADC PPB2 Offset Reference Register */
      __IO uint32_t ADCPPB2OFFREF_LITE__ADCPPB2OFFREF_1;/* !< ADC PPB2 Offset Reference Register */
  };
  union {
      __IO uint32_t ADCPPB2TRIPHI_LITE_;               /* !< ADC PPB2 Trip High Register */
      __IO uint32_t ADCPPB2TRIPHI_LITE__ADCPPB2TRIPHI_1;/* !< ADC PPB2 Trip High Register */
  };
  union {
      __IO uint32_t ADCPPB2TRIPLO_LITE_;               /* !< ADC PPB2 Trip Low/Trigger Time Stamp Register */
      __IO uint32_t ADCPPB2TRIPLO_LITE__ADCPPB2TRIPLO_1;/* !< ADC PPB2 Trip Low/Trigger Time Stamp Register */
  };
  __IO uint32_t Reserved_13[2];                    /* !< (@ 0x00001138) */
  union {
      __IO uint32_t ADCPPB3CONFIG_M33_;                /* !< ADC PPB3 Config Register */
      __IO uint32_t ADCPPB3CONFIG_M33__ADCPPB3CONFIG_1;/* !< ADC PPB3 Config Register */
  };
  __IO uint32_t Reserved_14;                       /* !< (@ 0x00001144) */
  union {
      __IO uint32_t ADCPPB3OFFCAL_LITE_;               /* !< ADC PPB3 Offset Calibration Register */
      __IO uint32_t ADCPPB3OFFCAL_LITE__ADCPPB3OFFCAL_1;/* !< ADC PPB3 Offset Calibration Register */
  };
  union {
      __IO uint32_t ADCPPB3OFFREF_LITE_;               /* !< ADC PPB3 Offset Reference Register */
      __IO uint32_t ADCPPB3OFFREF_LITE__ADCPPB3OFFREF_1;/* !< ADC PPB3 Offset Reference Register */
  };
  union {
      __IO uint32_t ADCPPB3TRIPHI_LITE_;               /* !< ADC PPB3 Trip High Register */
      __IO uint32_t ADCPPB3TRIPHI_LITE__ADCPPB3TRIPHI_1;/* !< ADC PPB3 Trip High Register */
  };
  union {
      __IO uint32_t ADCPPB3TRIPLO_LITE_;               /* !< ADC PPB3 Trip Low/Trigger Time Stamp Register */
      __IO uint32_t ADCPPB3TRIPLO_LITE__ADCPPB3TRIPLO_1;/* !< ADC PPB3 Trip Low/Trigger Time Stamp Register */
  };
  __IO uint32_t Reserved_15[2];                    /* !< (@ 0x00001158) */
  union {
      __IO uint32_t ADCPPB4CONFIG_M33_;                /* !< ADC PPB4 Config Register */
      __IO uint32_t ADCPPB4CONFIG_M33__ADCPPB4CONFIG_1;/* !< ADC PPB4 Config Register */
  };
  __IO uint32_t Reserved_16;                       /* !< (@ 0x00001164) */
  union {
      __IO uint32_t ADCPPB4OFFCAL_LITE_;               /* !< ADC PPB4 Offset Calibration Register */
      __IO uint32_t ADCPPB4OFFCAL_LITE__ADCPPB4OFFCAL_1;/* !< ADC PPB4 Offset Calibration Register */
  };
  union {
      __IO uint32_t ADCPPB4OFFREF_LITE_;               /* !< ADC PPB4 Offset Reference Register */
      __IO uint32_t ADCPPB4OFFREF_LITE__ADCPPB4OFFREF_1;/* !< ADC PPB4 Offset Reference Register */
  };
  union {
      __IO uint32_t ADCPPB4TRIPHI_LITE_;               /* !< ADC PPB4 Trip High Register */
      __IO uint32_t ADCPPB4TRIPHI_LITE__ADCPPB4TRIPHI_1;/* !< ADC PPB4 Trip High Register */
  };
  union {
      __IO uint32_t ADCPPB4TRIPLO_LITE_;               /* !< ADC PPB4 Trip Low/Trigger Time Stamp Register */
      __IO uint32_t ADCPPB4TRIPLO_LITE__ADCPPB4TRIPLO_1;/* !< ADC PPB4 Trip Low/Trigger Time Stamp Register */
  };
  __IO uint32_t Reserved_17[2];                    /* !< (@ 0x00001178) */
  union {
      __IO uint32_t ADCINTCYCLE_LITE_;                 /* !< ADC Early Interrupt Generation Cycle */
      __IO uint32_t ADCINTCYCLE_LITE__ADCINTCYCLE_1;   /* !< ADC Early Interrupt Generation Cycle */
  };
  union {
      __IO uint32_t ADCINLTRIM1_TYPE3P1_;              /* !< ADC Linearity Trim 1 Register */
      __IO uint32_t ADCINLTRIM1_TYPE3P1__ADCINLTRIM1_1;/* !< ADC Linearity Trim 1 Register */
  };
  union {
      __IO uint32_t ADCINLTRIM2_TYPE3P1_;              /* !< ADC Linearity Trim 2 Register */
      __IO uint32_t ADCINLTRIM2_TYPE3P1__ADCINLTRIM2_1;/* !< ADC Linearity Trim 2 Register */
  };
  union {
      __IO uint32_t ADCINLTRIM3_TYPE3P1_;              /* !< ADC Linearity Trim 3 Register */
      __IO uint32_t ADCINLTRIM3_TYPE3P1__ADCINLTRIM3_1;/* !< ADC Linearity Trim 3 Register */
  };
  union {
      __IO uint32_t ADCINLTRIM4_TYPE3P1_;              /* !< ADC Linearity Trim 4 Register */
      __IO uint32_t ADCINLTRIM4_TYPE3P1__ADCINLTRIM4_1;/* !< ADC Linearity Trim 4 Register */
  };
  union {
      __IO uint32_t ADCINLTRIM5_TYPE3P1_;              /* !< ADC Linearity Trim 5 Register */
      __IO uint32_t ADCINLTRIM5_TYPE3P1__ADCINLTRIM5_1;/* !< ADC Linearity Trim 5 Register */
  };
  union {
      __IO uint32_t ADCINLTRIM6_TYPE3P1_;              /* !< ADC Linearity Trim 6 Register */
      __IO uint32_t ADCINLTRIM6_TYPE3P1__ADCINLTRIM6_1;/* !< ADC Linearity Trim 6 Register */
  };
  union {
      __IO uint32_t ADCREV2_LITE_;                     /* !< ADC Wrapper Revision Register */
      __IO uint32_t ADCREV2_LITE__ADCREV2_1;           /* !< ADC Wrapper Revision Register */
  };
  union {
      __IO uint32_t ADCINLTRIMCTL_HSADC12B_;           /* !< ADC Linearity Trim Control Register */
      __IO uint32_t ADCINLTRIMCTL_HSADC12B__ADCINLTRIMCTL_1;/* !< ADC Linearity Trim Control Register */
  };
  __IO uint32_t Reserved_18[7];                    /* !< (@ 0x000011A4) */
  union {
      __IO uint32_t REP1CTL_LITE_;                     /* !< ADC Trigger Repeater 1 Control Register */
      __IO uint32_t REP1CTL_LITE__REP1CTL_1;           /* !< ADC Trigger Repeater 1 Control Register */
  };
  union {
      __IO uint32_t REP1N_LITE_;                       /* !< ADC Trigger Repeater 1 N Select Register */
      __IO uint32_t REP1N_LITE__REP1N_1;               /* !< ADC Trigger Repeater 1 N Select Register */
  };
  __IO uint32_t REP1PHASE;                         /* !< (@ 0x000011C8) ADC Trigger Repeater 1 Phase Select Register */
  __IO uint32_t REP1SPREAD;                        /* !< (@ 0x000011CC) ADC Trigger Repeater 1 Spread Select Register */
  union {
      __IO uint32_t REP1FRC_LITE_;                     /* !< ADC Trigger Repeater 1 Software Force Register */
      __IO uint32_t REP1FRC_LITE__REP1FRC_1;           /* !< ADC Trigger Repeater 1 Software Force Register */
  };
  __IO uint32_t Reserved_19[3];                    /* !< (@ 0x000011D4) */
  union {
      __IO uint32_t REP2CTL_LITE_;                     /* !< ADC Trigger Repeater 2 Control Register */
      __IO uint32_t REP2CTL_LITE__REP2CTL_1;           /* !< ADC Trigger Repeater 2 Control Register */
  };
  union {
      __IO uint32_t REP2N_LITE_;                       /* !< ADC Trigger Repeater 2 N Select Register */
      __IO uint32_t REP2N_LITE__REP2N_1;               /* !< ADC Trigger Repeater 2 N Select Register */
  };
  __IO uint32_t REP2PHASE;                         /* !< (@ 0x000011E8) ADC Trigger Repeater 2 Phase Select Register */
  __IO uint32_t REP2SPREAD;                        /* !< (@ 0x000011EC) ADC Trigger Repeater 2 Spread Select Register */
  union {
      __IO uint32_t REP2FRC_LITE_;                     /* !< ADC Trigger Repeater 2 Software Force Register */
      __IO uint32_t REP2FRC_LITE__REP2FRC_1;           /* !< ADC Trigger Repeater 2 Software Force Register */
  };
  __IO uint32_t Reserved_20[3];                    /* !< (@ 0x000011F4) */
  union {
      __IO uint32_t ADCPPB1LIMIT_LITE_;                /* !< ADC PPB1Conversion Count Limit Register */
      __IO uint32_t ADCPPB1LIMIT_LITE__ADCPPB1LIMIT_1; /* !< ADC PPB1Conversion Count Limit Register */
  };
  union {
      __IO uint32_t ADCPPB1PCOUNT_LITE_;               /* !< ADC PPB1 Partial Conversion Count Register */
      __IO uint32_t ADCPPB1PCOUNT_LITE__ADCPPB1PCOUNT_1;/* !< ADC PPB1 Partial Conversion Count Register */
  };
  union {
      __IO uint32_t ADCPPB1CONFIG2_M33_;               /* !< ADC PPB1 Sum Shift Register */
      __IO uint32_t ADCPPB1CONFIG2_M33__ADCPPB1CONFIG2_1;/* !< ADC PPB1 Sum Shift Register */
  };
  union {
      __IO uint32_t ADCPPB1PSUM_LITE_;                 /* !< ADC PPB1 Partial Sum Register */
      __IO uint32_t ADCPPB1PSUM_LITE__ADCPPB1PSUM_1;   /* !< ADC PPB1 Partial Sum Register */
  };
  __IO uint32_t ADCPPB1PMAX;                       /* !< (@ 0x00001210) ADC PPB1 Partial Max Register */
  __IO uint32_t Reserved_21;                       /* !< (@ 0x00001214) */
  __IO uint32_t ADCPPB1PMIN;                       /* !< (@ 0x00001218) ADC PPB1 Partial MIN Register */
  __IO uint32_t Reserved_22;                       /* !< (@ 0x0000121C) */
  __IO uint32_t ADCPPB1TRIPLO2;                    /* !< (@ 0x00001220) ADC PPB1 Extended Trip Low Register */
  __IO uint32_t Reserved_23[7];                    /* !< (@ 0x00001224) */
  union {
      __IO uint32_t ADCPPB2LIMIT_LITE_;                /* !< ADC PPB2Conversion Count Limit Register */
      __IO uint32_t ADCPPB2LIMIT_LITE__ADCPPB2LIMIT_1; /* !< ADC PPB2Conversion Count Limit Register */
  };
  union {
      __IO uint32_t ADCPPB2PCOUNT_LITE_;               /* !< ADC PPB2 Partial Conversion Count Register */
      __IO uint32_t ADCPPB2PCOUNT_LITE__ADCPPB2PCOUNT_1;/* !< ADC PPB2 Partial Conversion Count Register */
  };
  union {
      __IO uint32_t ADCPPB2CONFIG2_M33_;               /* !< ADC PPB2 Sum Shift Register */
      __IO uint32_t ADCPPB2CONFIG2_M33__ADCPPB2CONFIG2_1;/* !< ADC PPB2 Sum Shift Register */
  };
  union {
      __IO uint32_t ADCPPB2PSUM_LITE_;                 /* !< ADC PPB2 Partial Sum Register */
      __IO uint32_t ADCPPB2PSUM_LITE__ADCPPB2PSUM_1;   /* !< ADC PPB2 Partial Sum Register */
  };
  __IO uint32_t ADCPPB2PMAX;                       /* !< (@ 0x00001250) ADC PPB2 Partial Max Register */
  __IO uint32_t Reserved_24;                       /* !< (@ 0x00001254) */
  __IO uint32_t ADCPPB2PMIN;                       /* !< (@ 0x00001258) ADC PPB2 Partial MIN Register */
  __IO uint32_t Reserved_25;                       /* !< (@ 0x0000125C) */
  __IO uint32_t ADCPPB2TRIPLO2;                    /* !< (@ 0x00001260) ADC PPB2 Extended Trip Low Register */
  __IO uint32_t Reserved_26[7];                    /* !< (@ 0x00001264) */
  union {
      __IO uint32_t ADCPPB3LIMIT_LITE_;                /* !< ADC PPB3Conversion Count Limit Register */
      __IO uint32_t ADCPPB3LIMIT_LITE__ADCPPB3LIMIT_1; /* !< ADC PPB3Conversion Count Limit Register */
  };
  union {
      __IO uint32_t ADCPPB3PCOUNT_LITE_;               /* !< ADC PPB3 Partial Conversion Count Register */
      __IO uint32_t ADCPPB3PCOUNT_LITE__ADCPPB3PCOUNT_1;/* !< ADC PPB3 Partial Conversion Count Register */
  };
  union {
      __IO uint32_t ADCPPB3CONFIG2_M33_;               /* !< ADC PPB3 Sum Shift Register */
      __IO uint32_t ADCPPB3CONFIG2_M33__ADCPPB3CONFIG2_1;/* !< ADC PPB3 Sum Shift Register */
  };
  union {
      __IO uint32_t ADCPPB3PSUM_LITE_;                 /* !< ADC PPB3 Partial Sum Register */
      __IO uint32_t ADCPPB3PSUM_LITE__ADCPPB3PSUM_1;   /* !< ADC PPB3 Partial Sum Register */
  };
  __IO uint32_t ADCPPB3PMAX;                       /* !< (@ 0x00001290) ADC PPB3 Partial Max Register */
  __IO uint32_t Reserved_27;                       /* !< (@ 0x00001294) */
  __IO uint32_t ADCPPB3PMIN;                       /* !< (@ 0x00001298) ADC PPB3 Partial MIN Register */
  __IO uint32_t Reserved_28;                       /* !< (@ 0x0000129C) */
  __IO uint32_t ADCPPB3TRIPLO2;                    /* !< (@ 0x000012A0) ADC PPB3 Extended Trip Low Register */
  __IO uint32_t Reserved_29[7];                    /* !< (@ 0x000012A4) */
  union {
      __IO uint32_t ADCPPB4LIMIT_LITE_;                /* !< ADC PPB4Conversion Count Limit Register */
      __IO uint32_t ADCPPB4LIMIT_LITE__ADCPPB4LIMIT_1; /* !< ADC PPB4Conversion Count Limit Register */
  };
  union {
      __IO uint32_t ADCPPB4PCOUNT_LITE_;               /* !< ADC PPB4 Partial Conversion Count Register */
      __IO uint32_t ADCPPB4PCOUNT_LITE__ADCPPB4PCOUNT_1;/* !< ADC PPB4 Partial Conversion Count Register */
  };
  union {
      __IO uint32_t ADCPPB4CONFIG2_M33_;               /* !< ADC PPB4 Sum Shift Register */
      __IO uint32_t ADCPPB4CONFIG2_M33__ADCPPB4CONFIG2_1;/* !< ADC PPB4 Sum Shift Register */
  };
  union {
      __IO uint32_t ADCPPB4PSUM_LITE_;                 /* !< ADC PPB4 Partial Sum Register */
      __IO uint32_t ADCPPB4PSUM_LITE__ADCPPB4PSUM_1;   /* !< ADC PPB4 Partial Sum Register */
  };
  __IO uint32_t ADCPPB4PMAX;                       /* !< (@ 0x000012D0) ADC PPB4 Partial Max Register */
  __IO uint32_t Reserved_30;                       /* !< (@ 0x000012D4) */
  __IO uint32_t ADCPPB4PMIN;                       /* !< (@ 0x000012D8) ADC PPB4 Partial MIN Register */
  __IO uint32_t Reserved_31;                       /* !< (@ 0x000012DC) */
  __IO uint32_t ADCPPB4TRIPLO2;                    /* !< (@ 0x000012E0) ADC PPB4 Extended Trip Low Register */
  __IO uint32_t Reserved_32[10];                   /* !< (@ 0x000012E4) */
  union {
      __IO uint32_t DTB_HSADC12B_;                     /* !< Digital Test Bus */
      __IO uint32_t DTB_HSADC12B__DTB_1;               /* !< Digital Test Bus */
  };
  __IO uint32_t Reserved_33[4];                    /* !< (@ 0x00001310) */
  union {
      __IO uint32_t ADCSEQCTL;                         /* !< ADC Sequencer common control Register */
      __IO uint32_t ADCSEQCTL_ADCSEQCTL_1;             /* !< ADC Sequencer common control Register */
