TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
  __IO uint32_t ADCPPB4PMAX;                       /* !< (@ 0x000012D0) ADC PPB4 Partial Max Register */
  __IO uint32_t Reserved_30;                       /* !< (@ 0x000012D4) */
  __IO uint32_t ADCPPB4PMIN;                       /* !< (@ 0x000012D8) ADC PPB4 Partial MIN Register */
  __IO uint32_t Reserved_31;                       /* !< (@ 0x000012DC) */
  __IO uint32_t ADCPPB4TRIPLO2;                    /* !< (@ 0x000012E0) ADC PPB4 Extended Trip Low Register */
  __IO uint32_t Reserved_32[10];                   /* !< (@ 0x000012E4) */
  union {
      __IO uint32_t DTB_HSADC12B_;                     /* !< Digital Test Bus */
      __IO uint32_t DTB_HSADC12B__DTB_1;               /* !< Digital Test Bus */
  };
  __IO uint32_t Reserved_33[4];                    /* !< (@ 0x00001310) */
  union {
      __IO uint32_t ADCSEQCTL;                         /* !< ADC Sequencer common control Register */
      __IO uint32_t ADCSEQCTL_ADCSEQCTL_1;             /* !< ADC Sequencer common control Register */
  };
  __IO uint32_t ADCSEQ1CONFIG;                     /* !< (@ 0x00001324) ADC Sequencer 1 Config register */
  __IO uint32_t ADCSEQ2CONFIG;                     /* !< (@ 0x00001328) ADC Sequencer 2 Config register */
  __IO uint32_t ADCSEQ3CONFIG;                     /* !< (@ 0x0000132C) ADC Sequencer 3 Config register */
  __IO uint32_t ADCSEQ4CONFIG;                     /* !< (@ 0x00001330) ADC Sequencer 4 Config register */
  __IO uint32_t Reserved_34[819];                  /* !< (@ 0x00001334) */
} HSADC0_ADC_LITE_REGS_Regs;

/*@}*/ /* end of group HSADC0_ADC_LITE_REGS */

} HSADC0_ADC_LITE_REGS_Regs;

/*@}*/ /* end of group HSADC0_ADC_LITE_REGS */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* HSADC0 Register Control Bits
******************************************************************************/

/* HSADC0_ADCRESULT0_12B_M33 Bits */
/* HSADC0_ADCRESULT0_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT0_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT0_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 0 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC0, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT0_1 Bits */
/* HSADC0_ADCRESULT0_1[RESULT] Bits */
#define HSADC0_ADCRESULT0_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT0_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 0 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC0, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT1_12B_M33 Bits */
/* HSADC0_ADCRESULT1_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT1_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT1_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 1 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC1, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT1_1 Bits */
/* HSADC0_ADCRESULT1_1[RESULT] Bits */
#define HSADC0_ADCRESULT1_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT1_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 1 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC1, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT2_12B_M33 Bits */
/* HSADC0_ADCRESULT2_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT2_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT2_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 2 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC2, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT2_1 Bits */
/* HSADC0_ADCRESULT2_1[RESULT] Bits */
#define HSADC0_ADCRESULT2_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT2_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 2 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC2, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT3_12B_M33 Bits */
/* HSADC0_ADCRESULT3_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT3_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT3_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 3 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC3, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT3_1 Bits */
/* HSADC0_ADCRESULT3_1[RESULT] Bits */
#define HSADC0_ADCRESULT3_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT3_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 3 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC3, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT4_12B_M33 Bits */
/* HSADC0_ADCRESULT4_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT4_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT4_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 4 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC4, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

