TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCRESULT4_1 Bits */
/* HSADC0_ADCRESULT4_1[RESULT] Bits */
#define HSADC0_ADCRESULT4_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT4_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 4 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC4, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT5_12B_M33 Bits */
/* HSADC0_ADCRESULT5_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT5_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT5_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 5 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC5, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT5_1 Bits */
/* HSADC0_ADCRESULT5_1[RESULT] Bits */
#define HSADC0_ADCRESULT5_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT5_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 5 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC5, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT6_12B_M33 Bits */
/* HSADC0_ADCRESULT6_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT6_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT6_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 6 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC6, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT6_1 Bits */
/* HSADC0_ADCRESULT6_1[RESULT] Bits */
#define HSADC0_ADCRESULT6_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT6_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 6 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC6, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT7_12B_M33 Bits */
/* HSADC0_ADCRESULT7_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT7_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT7_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 7 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC7, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT7_1 Bits */
/* HSADC0_ADCRESULT7_1[RESULT] Bits */
#define HSADC0_ADCRESULT7_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT7_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 7 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC7, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT8_12B_M33 Bits */
/* HSADC0_ADCRESULT8_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT8_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT8_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 8 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC8, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT8_1 Bits */
/* HSADC0_ADCRESULT8_1[RESULT] Bits */
#define HSADC0_ADCRESULT8_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT8_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 8 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC8, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

