TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCSEQ4FIFOSTATUS Bits */
/* HSADC0_ADCSEQ4FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC0_ADCSEQ4FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC0_ADCSEQ4FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 4 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC0_ADCSEQ4FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC0_ADCSEQ4FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC0_ADCSEQ4FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 4 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ4FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC0_ADCRESULT0_12B_M33 Bits */
/* HSADC0_ADCRESULT0_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT0_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT0_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 0 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC0, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT0_1 Bits */
/* HSADC0_ADCRESULT0_1[RESULT] Bits */
#define HSADC0_ADCRESULT0_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT0_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 0 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC0, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT1_12B_M33 Bits */
/* HSADC0_ADCRESULT1_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT1_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT1_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 1 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC1, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT1_1 Bits */
/* HSADC0_ADCRESULT1_1[RESULT] Bits */
#define HSADC0_ADCRESULT1_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT1_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 1 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC1, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT2_12B_M33 Bits */
/* HSADC0_ADCRESULT2_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT2_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT2_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 2 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC2, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT2_1 Bits */
/* HSADC0_ADCRESULT2_1[RESULT] Bits */
#define HSADC0_ADCRESULT2_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT2_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 2 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC2, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT3_12B_M33 Bits */
/* HSADC0_ADCRESULT3_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT3_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT3_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 3 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC3, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT3_1 Bits */
/* HSADC0_ADCRESULT3_1[RESULT] Bits */
#define HSADC0_ADCRESULT3_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT3_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 3 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC3, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC0_ADCRESULT4_12B_M33 Bits */
/* HSADC0_ADCRESULT4_12B_M33[RESULT] Bits */
#define HSADC0_ADCRESULT4_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC0_ADCRESULT4_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 4 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC4, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

