TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCINTFLG_4INT Bits */
/* HSADC0_ADCINTFLG_4INT[ADCINT1] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT1_OFS        (0)                             /* !< ADCINT1 Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT1_MASK       ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Flag. Reading these
                                                                                    flags indicates if the associated
                                                                                    ADCINT pulse was generated since the
                                                                                    last clear. #br# #br#  0  No ADC
                                                                                    interrupt pulse generated #br#  1
                                                                                    ADC interrupt pulse generated #br#
                                                                                    #br#If the ADC interrupt is placed in
                                                                                    continue to interrupt mode (INTSEL
                                                                                    register) then further interrupt
                                                                                    pulses are generated whenever a
                                                                                    selected EOC event occurs even if the
                                                                                    flag bit is set. If the continuous
                                                                                    mode is not enabled, then no further
                                                                                    interrupt pulses are generated until
                                                                                    the user clears this flag bit using
                                                                                    the ADCINTFLGCLR register. Rather, an
                                                                                    ADC interrupt overflow event occurs
                                                                                    in the ADCINTOVF register. */
/* HSADC0_ADCINTFLG_4INT[ADCINT2] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT2_OFS        (1)                             /* !< ADCINT2 Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT2_MASK       ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Flag. Reading these
                                                                                    flags indicates if the associated
                                                                                    ADCINT pulse was generated since the
                                                                                    last clear. #br# #br#  0  No ADC
                                                                                    interrupt pulse generated #br#  1
                                                                                    ADC interrupt pulse generated #br#
                                                                                    #br#If the ADC interrupt is placed in
                                                                                    continue to interrupt mode (INTSEL
                                                                                    register) then further interrupt
                                                                                    pulses are generated whenever a
                                                                                    selected EOC event occurs even if the
                                                                                    flag bit is set. If the continuous
                                                                                    mode is not enabled, then no further
                                                                                    interrupt pulses are generated until
                                                                                    the user clears this flag bit using
                                                                                    the ADCINTFLGCLR register. Rather, an
                                                                                    ADC interrupt overflow event occurs
                                                                                    in the ADCINTOVF register. */
/* HSADC0_ADCINTFLG_4INT[ADCINT3] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT3_OFS        (2)                             /* !< ADCINT3 Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT3_MASK       ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Flag. Reading these
                                                                                    flags indicates if the associated
                                                                                    ADCINT pulse was generated since the
                                                                                    last clear. #br# #br#  0  No ADC
                                                                                    interrupt pulse generated #br#  1
                                                                                    ADC interrupt pulse generated #br#
                                                                                    #br#If the ADC interrupt is placed in
                                                                                    continue to interrupt mode (INTSEL
                                                                                    register) then further interrupt
                                                                                    pulses are generated whenever a
                                                                                    selected EOC event occurs even if the
                                                                                    flag bit is set. If the continuous
                                                                                    mode is not enabled, then no further
                                                                                    interrupt pulses are generated until
                                                                                    the user clears this flag bit using
                                                                                    the ADCINTFLGCLR register. Rather, an
                                                                                    ADC interrupt overflow event occurs
                                                                                    in the ADCINTOVF register. */
/* HSADC0_ADCINTFLG_4INT[ADCINT4] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT4_OFS        (3)                             /* !< ADCINT4 Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT4_MASK       ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Flag. Reading these
                                                                                    flags indicates if the associated
                                                                                    ADCINT pulse was generated since the
                                                                                    last clear. #br# #br#  0  No ADC
                                                                                    interrupt pulse generated #br#  1
                                                                                    ADC interrupt pulse generated #br#
                                                                                    #br#If the ADC interrupt is placed in
                                                                                    continue to interrupt mode (INTSEL
                                                                                    register) then further interrupt
                                                                                    pulses are generated whenever a
                                                                                    selected EOC event occurs even if the
                                                                                    flag bit is set. If the continuous
                                                                                    mode is not enabled, then no further
                                                                                    interrupt pulses are generated until
                                                                                    the user clears this flag bit using
                                                                                    the ADCINFLGCLR register. Rather, an
                                                                                    ADC interrupt overflow event occurs
                                                                                    in the ADCINTOVF register. */
/* HSADC0_ADCINTFLG_4INT[ADCINT1RESULT] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT1RESULT_OFS  (8)                             /* !< ADCINT1RESULT Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT1RESULT_MASK ((uint32_t)0x00000100U)         /* !< ADC Interrupt 1 Results Ready Flag.
                                                                                    This flag is set when the conversions
                                                                                    results associated with ADCINT1 latch
                                                                                    into the corresponding results
                                                                                    register.   #br# #br#  0  Conversion
                                                                                    results have not latched #br#  1
                                                                                    Conversion results have latched #br#
                                                                                    #br#This flag can be used in an ISR
                                                                                    that is entered in early interrupt
                                                                                    mode to ensure that the corresponding
                                                                                    results are ready before proceeding
                                                                                    to read the result register.   #br#
                                                                                    #br#This flag can be cleared via the
                                                                                    ACK bit in the ADCINTFLGCLR that also
                                                                                    clears the ADCINT1 flag.    #br#
                                                                                    #br#In case results latch and this
                                                                                    flag is already set, the
                                                                                    corresponding flag in ADCINTOVF is
                                                                                    NOT set.  This flag does NOT have to
                                                                                    be cleared in order for ADCINT ISRs
                                                                                    to propagate to the PIE.   #br#
                                                                                    #br#In case the associated SOC is
                                                                                    associated with a PPB or PPBs, the
                                                                                    flag will not be set until all
                                                                                    associated PPB results latch. */
/* HSADC0_ADCINTFLG_4INT[ADCINT2RESULT] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT2RESULT_OFS  (9)                             /* !< ADCINT2RESULT Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT2RESULT_MASK ((uint32_t)0x00000200U)         /* !< ADC Interrupt 2 Results Ready Flag.
                                                                                    This flag is set when the conversions
                                                                                    results associated with ADCINT2 latch
                                                                                    into the corresponding results
                                                                                    register.   #br# #br#  0  Conversion
                                                                                    results have not latched #br#  1
                                                                                    Conversion results have latched #br#
                                                                                    #br#This flag can be used in an ISR
                                                                                    that is entered in early interrupt
                                                                                    mode to ensure that the corresponding
                                                                                    results are ready before proceeding
                                                                                    to read the result register.   #br#
                                                                                    #br#This flag can be cleared via the
                                                                                    ACK bit in the ADCINTFLGCLR that also
                                                                                    clears the ADCINT2 flag.    #br#
                                                                                    #br#In case results latch and this
                                                                                    flag is already set, the
                                                                                    corresponding flag in ADCINTOVF is
                                                                                    NOT set.  This flag does NOT have to
                                                                                    be cleared in order for ADCINT ISRs
                                                                                    to propagate to the PIE.   #br#
                                                                                    #br#In case the associated SOC is
                                                                                    associated with a PPB or PPBs, the
                                                                                    flag will not be set until all
                                                                                    associated PPB results latch. */
/* HSADC0_ADCINTFLG_4INT[ADCINT3RESULT] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT3RESULT_OFS  (10)                            /* !< ADCINT3RESULT Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT3RESULT_MASK ((uint32_t)0x00000400U)         /* !< ADC Interrupt 3 Results Ready Flag.
                                                                                    This flag is set when the conversions
                                                                                    results associated with ADCINT3 latch
                                                                                    into the corresponding results
                                                                                    register.   #br# #br#  0  Conversion
                                                                                    results have not latched #br#  1
                                                                                    Conversion results have latched #br#
                                                                                    #br#This flag can be used in an ISR
                                                                                    that is entered in early interrupt
                                                                                    mode to ensure that the corresponding
                                                                                    results are ready before proceeding
                                                                                    to read the result register.   #br#
                                                                                    #br#This flag can be cleared via the
                                                                                    ACK bit in the ADCINTFLGCLR that also
                                                                                    clears the ADCINT3 flag.    #br#
                                                                                    #br#In case results latch and this
                                                                                    flag is already set, the
                                                                                    corresponding flag in ADCINTOVF is
                                                                                    NOT set.  This flag does NOT have to
                                                                                    be cleared in order for ADCINT ISRs
                                                                                    to propagate to the PIE.   #br#
                                                                                    #br#In case the associated SOC is
                                                                                    associated with a PPB or PPBs, the
                                                                                    flag will not be set until all
                                                                                    associated PPB results latch. */
/* HSADC0_ADCINTFLG_4INT[ADCINT4RESULT] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCINT4RESULT_OFS  (11)                            /* !< ADCINT4RESULT Offset */
#define HSADC0_ADCINTFLG_4INT_ADCINT4RESULT_MASK ((uint32_t)0x00000800U)         /* !< ADC Interrupt 4 Results Ready Flag.
                                                                                    This flag is set when the conversions
                                                                                    results associated with ADCINT4 latch
                                                                                    into the corresponding results
                                                                                    register.   #br# #br#  0  Conversion
                                                                                    results have not latched #br#  1
                                                                                    Conversion results have latched #br#
                                                                                    #br#This flag can be used in an ISR
                                                                                    that is entered in early interrupt
                                                                                    mode to ensure that the corresponding
                                                                                    results are ready before proceeding
                                                                                    to read the result register.   #br#
                                                                                    #br#This flag can be cleared via the
                                                                                    ACK bit in the ADCINTFLGCLR that also
                                                                                    clears the ADCINT4 flag.    #br#
                                                                                    #br#In case results latch and this
                                                                                    flag is already set, the
                                                                                    corresponding flag in ADCINTOVF is
                                                                                    NOT set.  This flag does NOT have to
                                                                                    be cleared in order for ADCINT ISRs
                                                                                    to propagate to the PIE.   #br#
                                                                                    #br#In case the associated SOC is
                                                                                    associated with a PPB or PPBs, the
                                                                                    flag will not be set until all
                                                                                    associated PPB results latch. */
/* HSADC0_ADCINTFLG_4INT[ADCDMAINT1] Bits */
#define HSADC0_ADCINTFLG_4INT_ADCDMAINT1_OFS     (16)                            /* !< ADCDMAINT1 Offset */
#define HSADC0_ADCINTFLG_4INT_ADCDMAINT1_MASK    ((uint32_t)0x00010000U)         /* !< ADC DMA Interrupt 1 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interrupt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    interrupt is placed in continue to
                                                                                    interrupt mode (DMAINTSEL register)
                                                                                    then further interrupt pulses are
                                                                                    generated whenever a selected EOC
                                                                                    event occurs even if the flag bit is
                                                                                    set. If the continuous mode is not
                                                                                    enabled, then no further interrupt
                                                                                    pulses are generated until the user
                                                                                    clears this flag bit using the
                                                                                    ADCINTFLGCLR register. Rather, an ADC
