TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCSOCPRICTL_LITE_ Bits */
/* HSADC0_ADCSOCPRICTL_LITE_[SOCPRIORITY] Bits */
#define HSADC0_ADCSOCPRICTL_LITE__SOCPRIORITY_OFS (0)                             /* !< SOCPRIORITY Offset */
#define HSADC0_ADCSOCPRICTL_LITE__SOCPRIORITY_MASK ((uint32_t)0x00000003U)         /* !< SOC Priority #br#Determines the
                                                                                    cutoff point for priority mode and
                                                                                    round robin arbitration for SOCx #br#
                                                                                    0h  SOC priority is handled in round
                                                                                    robin mode for all channels. #br#  1h
                                                                                    SOC0 is high priority, rest of
                                                                                    channels are in round robin mode.
                                                                                    #br#  2h  SOC0-SOC1 are high
                                                                                    priority, SOC2-SOC15 are in round
                                                                                    robin mode. #br#  3h  SOC0-SOC2 are
                                                                                    high priority, SOC3-SOC15 are in
                                                                                    round robin mode. */
/* HSADC0_ADCSOCPRICTL_LITE_[RRPOINTER] Bits */
#define HSADC0_ADCSOCPRICTL_LITE__RRPOINTER_OFS  (6)                             /* !< RRPOINTER Offset */
#define HSADC0_ADCSOCPRICTL_LITE__RRPOINTER_MASK ((uint32_t)0x000007C0U)         /* !< Round Robin Pointer. Holds the
                                                                                    value of the last converted round
                                                                                    robin SOCx to be used by the round
                                                                                    robin scheme to determine order of
                                                                                    conversions. #br#  00h  SOC0 was last
                                                                                    round robin SOC to convert, SOC1 is
                                                                                    highest round robin priority. #br#
                                                                                    01h  SOC1 was last round robin SOC to
                                                                                    convert, SOC2 is highest round robin
                                                                                    priority. #br#  02h  SOC2 was last
                                                                                    round robin SOC to convert, SOC3 is
                                                                                    highest round robin priority. #br#
                                                                                    03h  SOC3 was last round robin SOC to
                                                                                    convert, SOC4 is highest round robin
                                                                                    priority. #br#  04h  SOC4 was last
                                                                                    round robin SOC to convert, SOC5 is
                                                                                    highest round robin priority. #br#
                                                                                    05h  SOC5 was last round robin SOC to
                                                                                    convert, SOC6 is highest round robin
                                                                                    priority. #br#  06h  SOC6 was last
                                                                                    round robin SOC to convert, SOC7 is
                                                                                    highest round robin priority. #br#
                                                                                    07h  SOC7 was last round robin SOC to
                                                                                    convert, SOC8 is highest round robin
                                                                                    priority. #br#  08h  SOC8 was last
                                                                                    round robin SOC to convert, SOC9 is
                                                                                    highest round robin priority. #br#
                                                                                    09h  SOC9 was last round robin SOC to
                                                                                    convert, SOC10 is highest round robin
                                                                                    priority. #br#  0Ah  SOC10 was last
                                                                                    round robin SOC to convert, SOC11 is
                                                                                    highest round robin priority. #br#
                                                                                    0Bh  SOC11 was last round robin SOC
                                                                                    to convert, SOC12 is highest round
                                                                                    robin priority. #br#  0Ch  SOC12 was
                                                                                    last round robin SOC to convert,
                                                                                    SOC13 is highest round robin
                                                                                    priority. #br#  0Dh  SOC13 was last
                                                                                    round robin SOC to convert, SOC14 is
                                                                                    highest round robin priority. #br#
                                                                                    0Eh  SOC14 was last round robin SOC
                                                                                    to convert, SOC15 is highest round
                                                                                    robin priority. #br#  0Fh  SOC15 was
                                                                                    last round robin SOC to convert, SOC0
                                                                                    is highest round robin priority. #br#
                                                                                    10h  Reset value to indicate no SOC
                                                                                    has been converted. SOC0 is highest
                                                                                    round robin priority. Set to this
                                                                                    value when the ADC module is reset by
                                                                                    SOFTPRES or when the ADCSOCPRICTL
                                                                                    register is written. In the latter
                                                                                    case, if a conversion is currently in
                                                                                    progress, it will complete and then
                                                                                    the new priority will take effect.
                                                                                    #br#Others  Invalid value. */

/* HSADC0_ADCSOCPRICTL_1 Bits */
/* HSADC0_ADCSOCPRICTL_1[SOCPRIORITY] Bits */
#define HSADC0_ADCSOCPRICTL_1_SOCPRIORITY_OFS    (0)                             /* !< SOCPRIORITY Offset */
#define HSADC0_ADCSOCPRICTL_1_SOCPRIORITY_MASK   ((uint32_t)0x00000003U)         /* !< SOC Priority #br#Determines the
                                                                                    cutoff point for priority mode and
                                                                                    round robin arbitration for SOCx #br#
                                                                                    0h  SOC priority is handled in round
                                                                                    robin mode for all channels. #br#  1h
                                                                                    SOC0 is high priority, rest of
                                                                                    channels are in round robin mode.
                                                                                    #br#  2h  SOC0-SOC1 are high
                                                                                    priority, SOC2-SOC15 are in round
                                                                                    robin mode. #br#  3h  SOC0-SOC2 are
                                                                                    high priority, SOC3-SOC15 are in
                                                                                    round robin mode. */
/* HSADC0_ADCSOCPRICTL_1[RRPOINTER] Bits */
#define HSADC0_ADCSOCPRICTL_1_RRPOINTER_OFS      (6)                             /* !< RRPOINTER Offset */
#define HSADC0_ADCSOCPRICTL_1_RRPOINTER_MASK     ((uint32_t)0x000007C0U)         /* !< Round Robin Pointer. Holds the
                                                                                    value of the last converted round
                                                                                    robin SOCx to be used by the round
                                                                                    robin scheme to determine order of
                                                                                    conversions. #br#  00h  SOC0 was last
                                                                                    round robin SOC to convert, SOC1 is
                                                                                    highest round robin priority. #br#
                                                                                    01h  SOC1 was last round robin SOC to
                                                                                    convert, SOC2 is highest round robin
                                                                                    priority. #br#  02h  SOC2 was last
                                                                                    round robin SOC to convert, SOC3 is
                                                                                    highest round robin priority. #br#
                                                                                    03h  SOC3 was last round robin SOC to
                                                                                    convert, SOC4 is highest round robin
                                                                                    priority. #br#  04h  SOC4 was last
                                                                                    round robin SOC to convert, SOC5 is
                                                                                    highest round robin priority. #br#
                                                                                    05h  SOC5 was last round robin SOC to
                                                                                    convert, SOC6 is highest round robin
                                                                                    priority. #br#  06h  SOC6 was last
                                                                                    round robin SOC to convert, SOC7 is
                                                                                    highest round robin priority. #br#
                                                                                    07h  SOC7 was last round robin SOC to
                                                                                    convert, SOC8 is highest round robin
                                                                                    priority. #br#  08h  SOC8 was last
                                                                                    round robin SOC to convert, SOC9 is
                                                                                    highest round robin priority. #br#
                                                                                    09h  SOC9 was last round robin SOC to
                                                                                    convert, SOC10 is highest round robin
                                                                                    priority. #br#  0Ah  SOC10 was last
                                                                                    round robin SOC to convert, SOC11 is
                                                                                    highest round robin priority. #br#
                                                                                    0Bh  SOC11 was last round robin SOC
                                                                                    to convert, SOC12 is highest round
                                                                                    robin priority. #br#  0Ch  SOC12 was
                                                                                    last round robin SOC to convert,
                                                                                    SOC13 is highest round robin
                                                                                    priority. #br#  0Dh  SOC13 was last
                                                                                    round robin SOC to convert, SOC14 is
                                                                                    highest round robin priority. #br#
                                                                                    0Eh  SOC14 was last round robin SOC
                                                                                    to convert, SOC15 is highest round
                                                                                    robin priority. #br#  0Fh  SOC15 was
                                                                                    last round robin SOC to convert, SOC0
                                                                                    is highest round robin priority. #br#
                                                                                    10h  Reset value to indicate no SOC
                                                                                    has been converted. SOC0 is highest
                                                                                    round robin priority. Set to this
                                                                                    value when the ADC module is reset by
                                                                                    SOFTPRES or when the ADCSOCPRICTL
                                                                                    register is written. In the latter
                                                                                    case, if a conversion is currently in
                                                                                    progress, it will complete and then
                                                                                    the new priority will take effect.
                                                                                    #br#Others  Invalid value. */

