TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC9. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC9 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC0_ADCSOCFRC1_1[SOC10] Bits */
#define HSADC0_ADCSOCFRC1_1_SOC10_OFS            (10)                            /* !< SOC10 Offset */
#define HSADC0_ADCSOCFRC1_1_SOC10_MASK           ((uint32_t)0x00000400U)         /* !< SOC10 Force Start of Conversion
                                                                                    Bit. Writing a 1 will force to 1 the
                                                                                    SOC10 flag in the ADCSOCFLG1
                                                                                    register. This can be used to
                                                                                    initiate a software initiated
                                                                                    conversion. Writes of 0 are ignored.
                                                                                    This bit will always read as a 0.
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Force SOC10 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC10. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC10 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC0_ADCSOCFRC1_1[SOC11] Bits */
#define HSADC0_ADCSOCFRC1_1_SOC11_OFS            (11)                            /* !< SOC11 Offset */
#define HSADC0_ADCSOCFRC1_1_SOC11_MASK           ((uint32_t)0x00000800U)         /* !< SOC11 Force Start of Conversion
                                                                                    Bit. Writing a 1 will force to 1 the
                                                                                    SOC11 flag in the ADCSOCFLG1
                                                                                    register. This can be used to
                                                                                    initiate a software initiated
                                                                                    conversion. Writes of 0 are ignored.
                                                                                    This bit will always read as a 0.
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Force SOC11 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC11. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC11 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC0_ADCSOCFRC1_1[SOC12] Bits */
#define HSADC0_ADCSOCFRC1_1_SOC12_OFS            (12)                            /* !< SOC12 Offset */
#define HSADC0_ADCSOCFRC1_1_SOC12_MASK           ((uint32_t)0x00001000U)         /* !< SOC12 Force Start of Conversion
                                                                                    Bit. Writing a 1 will force to 1 the
                                                                                    SOC12 flag in the ADCSOCFLG1
                                                                                    register. This can be used to
                                                                                    initiate a software initiated
                                                                                    conversion. Writes of 0 are ignored.
                                                                                    This bit will always read as a 0.
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Force SOC12 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC12. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC12 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC0_ADCSOCFRC1_1[SOC13] Bits */
#define HSADC0_ADCSOCFRC1_1_SOC13_OFS            (13)                            /* !< SOC13 Offset */
#define HSADC0_ADCSOCFRC1_1_SOC13_MASK           ((uint32_t)0x00002000U)         /* !< SOC13 Force Start of Conversion
                                                                                    Bit. Writing a 1 will force to 1 the
                                                                                    SOC13 flag in the ADCSOCFLG1
                                                                                    register. This can be used to
                                                                                    initiate a software initiated
                                                                                    conversion. Writes of 0 are ignored.
                                                                                    This bit will always read as a 0.
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Force SOC13 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC13. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC13 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC0_ADCSOCFRC1_1[SOC14] Bits */
#define HSADC0_ADCSOCFRC1_1_SOC14_OFS            (14)                            /* !< SOC14 Offset */
#define HSADC0_ADCSOCFRC1_1_SOC14_MASK           ((uint32_t)0x00004000U)         /* !< SOC14 Force Start of Conversion
                                                                                    Bit. Writing a 1 will force to 1 the
                                                                                    SOC14 flag in the ADCSOCFLG1
                                                                                    register. This can be used to
                                                                                    initiate a software initiated
                                                                                    conversion. Writes of 0 are ignored.
                                                                                    This bit will always read as a 0.
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Force SOC14 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC14. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC14 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC0_ADCSOCFRC1_1[SOC15] Bits */
#define HSADC0_ADCSOCFRC1_1_SOC15_OFS            (15)                            /* !< SOC15 Offset */
#define HSADC0_ADCSOCFRC1_1_SOC15_MASK           ((uint32_t)0x00008000U)         /* !< SOC15 Force Start of Conversion
                                                                                    Bit. Writing a 1 will force to 1 the
                                                                                    SOC15 flag in the ADCSOCFLG1
                                                                                    register. This can be used to
                                                                                    initiate a software initiated
                                                                                    conversion. Writes of 0 are ignored.
                                                                                    This bit will always read as a 0.
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Force SOC15 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC15. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC15 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */

