TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC12 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC0_ADCSOCOVFCLR1_1[SOC13OVF] Bits */
#define HSADC0_ADCSOCOVFCLR1_1_SOC13OVF_OFS      (13)                            /* !< SOC13OVF Offset */
#define HSADC0_ADCSOCOVFCLR1_1_SOC13OVF_MASK     ((uint32_t)0x00002000U)         /* !< SOC13 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC13 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC13 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC0_ADCSOCOVFCLR1_1[SOC14OVF] Bits */
#define HSADC0_ADCSOCOVFCLR1_1_SOC14OVF_OFS      (14)                            /* !< SOC14OVF Offset */
#define HSADC0_ADCSOCOVFCLR1_1_SOC14OVF_MASK     ((uint32_t)0x00004000U)         /* !< SOC14 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC14 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC14 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC0_ADCSOCOVFCLR1_1[SOC15OVF] Bits */
#define HSADC0_ADCSOCOVFCLR1_1_SOC15OVF_OFS      (15)                            /* !< SOC15OVF Offset */
#define HSADC0_ADCSOCOVFCLR1_1_SOC15OVF_MASK     ((uint32_t)0x00008000U)         /* !< SOC15 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC15 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC15 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */

