TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCSOC6CTL_M33_ Bits */
/* HSADC0_ADCSOC6CTL_M33_[CHSEL] Bits */
#define HSADC0_ADCSOC6CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC6CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC6 Channel Select. Selects the
                                                                                    channel to be converted when SOC6 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC6CTL_M33_[COMPEN] Bits */
#define HSADC0_ADCSOC6CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC6CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC6 Threshold comparator enable. */

/* HSADC0_ADCSOC6CTL_1 Bits */
/* HSADC0_ADCSOC6CTL_1[CHSEL] Bits */
#define HSADC0_ADCSOC6CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC6CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC6 Channel Select. Selects the
                                                                                    channel to be converted when SOC6 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC6CTL_1[COMPEN] Bits */
#define HSADC0_ADCSOC6CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC6CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC6 Threshold comparator enable. */

/* HSADC0_ADCSOC7CTL_M33_ Bits */
/* HSADC0_ADCSOC7CTL_M33_[CHSEL] Bits */
#define HSADC0_ADCSOC7CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC7CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC7 Channel Select. Selects the
                                                                                    channel to be converted when SOC7 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC7CTL_M33_[COMPEN] Bits */
#define HSADC0_ADCSOC7CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC7CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC7 Threshold comparator enable. */

/* HSADC0_ADCSOC7CTL_1 Bits */
/* HSADC0_ADCSOC7CTL_1[CHSEL] Bits */
#define HSADC0_ADCSOC7CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC7CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC7 Channel Select. Selects the
                                                                                    channel to be converted when SOC7 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC7CTL_1[COMPEN] Bits */
#define HSADC0_ADCSOC7CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC7CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC7 Threshold comparator enable. */

/* HSADC0_ADCSOC8CTL_M33_ Bits */
/* HSADC0_ADCSOC8CTL_M33_[CHSEL] Bits */
#define HSADC0_ADCSOC8CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC8CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC8 Channel Select. Selects the
                                                                                    channel to be converted when SOC8 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC8CTL_M33_[COMPEN] Bits */
#define HSADC0_ADCSOC8CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC8CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC8 Threshold comparator enable. */

/* HSADC0_ADCSOC8CTL_1 Bits */
/* HSADC0_ADCSOC8CTL_1[CHSEL] Bits */
#define HSADC0_ADCSOC8CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC8CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC8 Channel Select. Selects the
                                                                                    channel to be converted when SOC8 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC8CTL_1[COMPEN] Bits */
#define HSADC0_ADCSOC8CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC8CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC8 Threshold comparator enable. */

/* HSADC0_ADCSOC9CTL_M33_ Bits */
/* HSADC0_ADCSOC9CTL_M33_[CHSEL] Bits */
#define HSADC0_ADCSOC9CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC9CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC9 Channel Select. Selects the
                                                                                    channel to be converted when SOC9 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC9CTL_M33_[COMPEN] Bits */
#define HSADC0_ADCSOC9CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC9CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC9 Threshold comparator enable. */

/* HSADC0_ADCSOC9CTL_1 Bits */
/* HSADC0_ADCSOC9CTL_1[CHSEL] Bits */
#define HSADC0_ADCSOC9CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC9CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC9 Channel Select. Selects the
                                                                                    channel to be converted when SOC9 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC9CTL_1[COMPEN] Bits */
#define HSADC0_ADCSOC9CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC9CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC9 Threshold comparator enable. */

