TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCPPB4OFFCAL_1 Bits */
/* HSADC0_ADCPPB4OFFCAL_1[OFFCAL] Bits */
#define HSADC0_ADCPPB4OFFCAL_1_OFFCAL_OFS        (0)                             /* !< OFFCAL Offset */
#define HSADC0_ADCPPB4OFFCAL_1_OFFCAL_MASK       ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

/* HSADC0_ADCPPB4OFFREF_LITE_ Bits */
/* HSADC0_ADCPPB4OFFREF_LITE_[OFFREF] Bits */
#define HSADC0_ADCPPB4OFFREF_LITE__OFFREF_OFS    (0)                             /* !< OFFREF Offset */
#define HSADC0_ADCPPB4OFFREF_LITE__OFFREF_MASK   ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB4RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC0_ADCPPB4OFFREF_1 Bits */
/* HSADC0_ADCPPB4OFFREF_1[OFFREF] Bits */
#define HSADC0_ADCPPB4OFFREF_1_OFFREF_OFS        (0)                             /* !< OFFREF Offset */
#define HSADC0_ADCPPB4OFFREF_1_OFFREF_MASK       ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB4RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC0_ADCPPB4TRIPHI_LITE_ Bits */
/* HSADC0_ADCPPB4TRIPHI_LITE_[LIMITHI] Bits */
#define HSADC0_ADCPPB4TRIPHI_LITE__LIMITHI_OFS   (0)                             /* !< LIMITHI Offset */
#define HSADC0_ADCPPB4TRIPHI_LITE__LIMITHI_MASK  ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC0_ADCPPB4TRIPHI_1 Bits */
/* HSADC0_ADCPPB4TRIPHI_1[LIMITHI] Bits */
#define HSADC0_ADCPPB4TRIPHI_1_LIMITHI_OFS       (0)                             /* !< LIMITHI Offset */
#define HSADC0_ADCPPB4TRIPHI_1_LIMITHI_MASK      ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC0_ADCPPB4TRIPLO_LITE_ Bits */
/* HSADC0_ADCPPB4TRIPLO_LITE_[LIMITLO] Bits */
#define HSADC0_ADCPPB4TRIPLO_LITE__LIMITLO_OFS   (0)                             /* !< LIMITLO Offset */
#define HSADC0_ADCPPB4TRIPLO_LITE__LIMITLO_MASK  ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC0_ADCPPB4TRIPLO_1 Bits */
/* HSADC0_ADCPPB4TRIPLO_1[LIMITLO] Bits */
#define HSADC0_ADCPPB4TRIPLO_1_LIMITLO_OFS       (0)                             /* !< LIMITLO Offset */
#define HSADC0_ADCPPB4TRIPLO_1_LIMITLO_MASK      ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC0_ADCINTCYCLE_LITE_ Bits */
/* HSADC0_ADCINTCYCLE_LITE_[DELAY] Bits */
#define HSADC0_ADCINTCYCLE_LITE__DELAY_OFS       (0)                             /* !< DELAY Offset */
#define HSADC0_ADCINTCYCLE_LITE__DELAY_MASK      ((uint32_t)0x0000003FU)         /* !< ADC Early Interrupt Generation
                                                                                    Cycle Delay: Defines the delay from
                                                                                    the fall edge of ADCSOC in terms of
                                                                                    system clock cycles, for the
                                                                                    interrupt to be generated. */

/* HSADC0_ADCINTCYCLE_1 Bits */
/* HSADC0_ADCINTCYCLE_1[DELAY] Bits */
#define HSADC0_ADCINTCYCLE_1_DELAY_OFS           (0)                             /* !< DELAY Offset */
#define HSADC0_ADCINTCYCLE_1_DELAY_MASK          ((uint32_t)0x0000003FU)         /* !< ADC Early Interrupt Generation
                                                                                    Cycle Delay: Defines the delay from
                                                                                    the fall edge of ADCSOC in terms of
                                                                                    system clock cycles, for the
                                                                                    interrupt to be generated. */

