TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCINLTRIM1_TYPE3P1_ Bits */
/* HSADC0_ADCINLTRIM1_TYPE3P1_[INLTRIM31TO0] Bits */
#define HSADC0_ADCINLTRIM1_TYPE3P1__INLTRIM31TO0_OFS (0)                             /* !< INLTRIM31TO0 Offset */
#define HSADC0_ADCINLTRIM1_TYPE3P1__INLTRIM31TO0_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 31-0. #br#
                                                                                    #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM1_1 Bits */
/* HSADC0_ADCINLTRIM1_1[INLTRIM31TO0] Bits */
#define HSADC0_ADCINLTRIM1_1_INLTRIM31TO0_OFS    (0)                             /* !< INLTRIM31TO0 Offset */
#define HSADC0_ADCINLTRIM1_1_INLTRIM31TO0_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 31-0. #br#
                                                                                    #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM2_TYPE3P1_ Bits */
/* HSADC0_ADCINLTRIM2_TYPE3P1_[INLTRIM63TO32] Bits */
#define HSADC0_ADCINLTRIM2_TYPE3P1__INLTRIM63TO32_OFS (0)                             /* !< INLTRIM63TO32 Offset */
#define HSADC0_ADCINLTRIM2_TYPE3P1__INLTRIM63TO32_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 63-32.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM2_1 Bits */
/* HSADC0_ADCINLTRIM2_1[INLTRIM63TO32] Bits */
#define HSADC0_ADCINLTRIM2_1_INLTRIM63TO32_OFS   (0)                             /* !< INLTRIM63TO32 Offset */
#define HSADC0_ADCINLTRIM2_1_INLTRIM63TO32_MASK  ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 63-32.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM3_TYPE3P1_ Bits */
/* HSADC0_ADCINLTRIM3_TYPE3P1_[INLTRIM95TO64] Bits */
#define HSADC0_ADCINLTRIM3_TYPE3P1__INLTRIM95TO64_OFS (0)                             /* !< INLTRIM95TO64 Offset */
#define HSADC0_ADCINLTRIM3_TYPE3P1__INLTRIM95TO64_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 95-64.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM3_1 Bits */
/* HSADC0_ADCINLTRIM3_1[INLTRIM95TO64] Bits */
#define HSADC0_ADCINLTRIM3_1_INLTRIM95TO64_OFS   (0)                             /* !< INLTRIM95TO64 Offset */
#define HSADC0_ADCINLTRIM3_1_INLTRIM95TO64_MASK  ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 95-64.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM4_TYPE3P1_ Bits */
/* HSADC0_ADCINLTRIM4_TYPE3P1_[INLTRIM127TO96] Bits */
#define HSADC0_ADCINLTRIM4_TYPE3P1__INLTRIM127TO96_OFS (0)                             /* !< INLTRIM127TO96 Offset */
#define HSADC0_ADCINLTRIM4_TYPE3P1__INLTRIM127TO96_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 127-96.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

