TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_REP2FRC_1 Bits */
/* HSADC0_REP2FRC_1[SWFRC] Bits */
#define HSADC0_REP2FRC_1_SWFRC_OFS               (0)                             /* !< SWFRC Offset */
#define HSADC0_REP2FRC_1_SWFRC_MASK              ((uint32_t)0x00000001U)         /* !< Write 1 to force a trigger to
                                                                                    repeat block 2 input regardless of
                                                                                    the value of TRIGGER. #br# #br#Always
                                                                                    reads 0. */

/* HSADC0_ADCPPB1LIMIT_LITE_ Bits */
/* HSADC0_ADCPPB1LIMIT_LITE_[LIMIT] Bits */
#define HSADC0_ADCPPB1LIMIT_LITE__LIMIT_OFS      (0)                             /* !< LIMIT Offset */
#define HSADC0_ADCPPB1LIMIT_LITE__LIMIT_MASK     ((uint32_t)0x00000003U)         /* !< Post Processing Block 1
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC0_ADCPPB1LIMIT_1 Bits */
/* HSADC0_ADCPPB1LIMIT_1[LIMIT] Bits */
#define HSADC0_ADCPPB1LIMIT_1_LIMIT_OFS          (0)                             /* !< LIMIT Offset */
#define HSADC0_ADCPPB1LIMIT_1_LIMIT_MASK         ((uint32_t)0x00000003U)         /* !< Post Processing Block 1
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC0_ADCPPB1PCOUNT_LITE_ Bits */
/* HSADC0_ADCPPB1PCOUNT_LITE_[PCOUNT] Bits */
#define HSADC0_ADCPPB1PCOUNT_LITE__PCOUNT_OFS    (0)                             /* !< PCOUNT Offset */
#define HSADC0_ADCPPB1PCOUNT_LITE__PCOUNT_MASK   ((uint32_t)0x00000007U)         /* !< Post Processing Block 1
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB1PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */

/* HSADC0_ADCPPB1PCOUNT_1 Bits */
/* HSADC0_ADCPPB1PCOUNT_1[PCOUNT] Bits */
#define HSADC0_ADCPPB1PCOUNT_1_PCOUNT_OFS        (0)                             /* !< PCOUNT Offset */
#define HSADC0_ADCPPB1PCOUNT_1_PCOUNT_MASK       ((uint32_t)0x00000007U)         /* !< Post Processing Block 1
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB1PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */

/* HSADC0_ADCPPB1CONFIG2_M33_ Bits */
/* HSADC0_ADCPPB1CONFIG2_M33_[SHIFT] Bits */
#define HSADC0_ADCPPB1CONFIG2_M33__SHIFT_OFS     (0)                             /* !< SHIFT Offset */
#define HSADC0_ADCPPB1CONFIG2_M33__SHIFT_MASK    ((uint32_t)0x00000007U)         /* !< Post Processing Block 1 right
                                                                                    shift.  Defines the number of bits to
                                                                                    right shift PSUM before loading into
                                                                                    the final SUM.   #br# #br#0 : no
                                                                                    right shift #br#1 : SUM = PSUM >> 1
                                                                                    #br#2 : SUM = PSUM >> 2 #br#... #br#7
                                                                                    : SUM = PSUM >> 7 */
/* HSADC0_ADCPPB1CONFIG2_M33_[SYNCINSEL] Bits */
#define HSADC0_ADCPPB1CONFIG2_M33__SYNCINSEL_OFS (4)                             /* !< SYNCINSEL Offset */
#define HSADC0_ADCPPB1CONFIG2_M33__SYNCINSEL_MASK ((uint32_t)0x00000070U)         /* !< PPB 1 sync. input select.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.   #br#Refer to SOC
                                                                                    spec for details */
/* HSADC0_ADCPPB1CONFIG2_M33_[SWSYNC] Bits */
#define HSADC0_ADCPPB1CONFIG2_M33__SWSYNC_OFS    (11)                            /* !< SWSYNC Offset */
#define HSADC0_ADCPPB1CONFIG2_M33__SWSYNC_MASK   ((uint32_t)0x00000800U)         /* !< PPB 1 software force sync.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.  #br# #br#Note: In
                                                                                    the case where the software force
                                                                                    occurs at the same time that a new
                                                                                    sample is added to the PSUM and the
                                                                                    PSUM is being used for a high or low
                                                                                    limit compare, then the comparison
                                                                                    will not occur. */
/* HSADC0_ADCPPB1CONFIG2_M33_[OSINTSEL] Bits */
#define HSADC0_ADCPPB1CONFIG2_M33__OSINTSEL_OFS  (12)                            /* !< OSINTSEL Offset */
#define HSADC0_ADCPPB1CONFIG2_M33__OSINTSEL_MASK ((uint32_t)0x00001000U)         /* !< Post Processing Block 1 Interrupt
                                                                                    Source Select.  #br# #br#OSINT1 can
                                                                                    be used to trigger an ADC interrupt
                                                                                    (ADCINT1 through ADCINT4) via
                                                                                    selection in the ADCINT1N2 or
                                                                                    ADCINT3N4.  This selection determines
                                                                                    if a sync. event can trigger OSINT1
                                                                                    in addition to a PCOUNT = LIMIT
                                                                                    event.     #br#   #br#0 = OSINT1 will
                                                                                    be generated from PCOUNT = LIMIT only
                                                                                    #br#1 = OSTIN1 will be generated form
                                                                                    PCOUNT = LIMIT or a sync. event.
                                                                                    #br# #br#Note: If a SYNC event would
                                                                                    cause an OSINT one cycle after OSINT
                                                                                    would have been cause by PCOUNT =
                                                                                    LIMIT match, then the second OSINT is
                                                                                    ignored. */
/* HSADC0_ADCPPB1CONFIG2_M33_[COMPSEL] Bits */
#define HSADC0_ADCPPB1CONFIG2_M33__COMPSEL_OFS   (15)                            /* !< COMPSEL Offset */
#define HSADC0_ADCPPB1CONFIG2_M33__COMPSEL_MASK  ((uint32_t)0x00008000U)         /* !< Post Processing Block 1 Compare
                                                                                    Source Select.  This field determines
                                                                                    whether ADCPPB1RESULT or ADCPPB1SUM
                                                                                    is used for the threshold compare.
                                                                                    #br# #br#0 = ADCPPB1RESULT is used
                                                                                    for compare logic #br#1 = ADCPPB1SUM
                                                                                    is used for compare logic */

