TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCPPB3LIMIT_LITE_ Bits */
/* HSADC0_ADCPPB3LIMIT_LITE_[LIMIT] Bits */
#define HSADC0_ADCPPB3LIMIT_LITE__LIMIT_OFS      (0)                             /* !< LIMIT Offset */
#define HSADC0_ADCPPB3LIMIT_LITE__LIMIT_MASK     ((uint32_t)0x00000003U)         /* !< Post Processing Block 3
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC0_ADCPPB3LIMIT_1 Bits */
/* HSADC0_ADCPPB3LIMIT_1[LIMIT] Bits */
#define HSADC0_ADCPPB3LIMIT_1_LIMIT_OFS          (0)                             /* !< LIMIT Offset */
#define HSADC0_ADCPPB3LIMIT_1_LIMIT_MASK         ((uint32_t)0x00000003U)         /* !< Post Processing Block 3
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC0_ADCPPB3PCOUNT_LITE_ Bits */
/* HSADC0_ADCPPB3PCOUNT_LITE_[PCOUNT] Bits */
#define HSADC0_ADCPPB3PCOUNT_LITE__PCOUNT_OFS    (0)                             /* !< PCOUNT Offset */
#define HSADC0_ADCPPB3PCOUNT_LITE__PCOUNT_MASK   ((uint32_t)0x00000007U)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB3PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */

/* HSADC0_ADCPPB3PCOUNT_1 Bits */
/* HSADC0_ADCPPB3PCOUNT_1[PCOUNT] Bits */
#define HSADC0_ADCPPB3PCOUNT_1_PCOUNT_OFS        (0)                             /* !< PCOUNT Offset */
#define HSADC0_ADCPPB3PCOUNT_1_PCOUNT_MASK       ((uint32_t)0x00000007U)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB3PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */

