TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCPPB4PMAX Bits */
/* HSADC0_ADCPPB4PMAX[PMAX] Bits */
#define HSADC0_ADCPPB4PMAX_PMAX_OFS              (0)                             /* !< PMAX Offset */
#define HSADC0_ADCPPB4PMAX_PMAX_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Max.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB4RESULT the result replaces
                                                                                    this register if it is larger.   #br#
                                                                                    #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB4 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */
/* HSADC0_ADCPPB4PMAX[SIGN] Bits */
#define HSADC0_ADCPPB4PMAX_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC0_ADCPPB4PMAX_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC0_ADCPPB4PMIN Bits */
/* HSADC0_ADCPPB4PMIN[PMIN] Bits */
#define HSADC0_ADCPPB4PMIN_PMIN_OFS              (0)                             /* !< PMIN Offset */
#define HSADC0_ADCPPB4PMIN_PMIN_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Min.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB4RESULT the result replaces
                                                                                    this register if it is smaller.
                                                                                    #br# #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB4 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */
/* HSADC0_ADCPPB4PMIN[SIGN] Bits */
#define HSADC0_ADCPPB4PMIN_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC0_ADCPPB4PMIN_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC0_ADCPPB4TRIPLO2 Bits */
/* HSADC0_ADCPPB4TRIPLO2[LIMITLO] Bits */
#define HSADC0_ADCPPB4TRIPLO2_LIMITLO_OFS        (0)                             /* !< LIMITLO Offset */
#define HSADC0_ADCPPB4TRIPLO2_LIMITLO_MASK       ((uint32_t)0x00FFFFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO2[23:17] will be ignored in 16
                                                                                    bit mode #br#- TRIPLO2[23:13] will be
                                                                                    ignored in 12 bit mode */

/* HSADC0_DTB_HSADC12B_ Bits */
/* HSADC0_DTB_HSADC12B_[DTB_OUT] Bits */
#define HSADC0_DTB_HSADC12B__DTB_OUT_OFS         (0)                             /* !< DTB_OUT Offset */
#define HSADC0_DTB_HSADC12B__DTB_OUT_MASK        ((uint32_t)0x0000FFFFU)         /* !< Digital Test Bus from HSADC12b */

