TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_RSTCTL Bits */
/* HSADC0_RSTCTL[RESETSTKYCLR] Bits */
#define HSADC0_RSTCTL_RESETSTKYCLR_OFS           (1)                             /* !< RESETSTKYCLR Offset */
#define HSADC0_RSTCTL_RESETSTKYCLR_MASK          ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define HSADC0_RSTCTL_RESETSTKYCLR_NOP           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define HSADC0_RSTCTL_RESETSTKYCLR_CLR           ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* HSADC0_RSTCTL[RESETASSERT] Bits */
#define HSADC0_RSTCTL_RESETASSERT_OFS            (0)                             /* !< RESETASSERT Offset */
#define HSADC0_RSTCTL_RESETASSERT_MASK           ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define HSADC0_RSTCTL_RESETASSERT_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define HSADC0_RSTCTL_RESETASSERT_ASSERT         ((uint32_t)0x00000001U)         /* !< Assert reset */
/* HSADC0_RSTCTL[KEY] Bits */
#define HSADC0_RSTCTL_KEY_OFS                    (24)                            /* !< KEY Offset */
#define HSADC0_RSTCTL_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define HSADC0_RSTCTL_KEY_UNLOCK_W               ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* HSADC0_STAT Bits */
/* HSADC0_STAT[RESETSTKYCLR] Bits */
#define HSADC0_STAT_RESETSTKYCLR_OFS             (16)                            /* !< RESETSTKYCLR Offset */
#define HSADC0_STAT_RESETSTKYCLR_MASK            ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define HSADC0_STAT_RESETSTKYCLR_NORES           ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define HSADC0_STAT_RESETSTKYCLR_RESET           ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* HSADC0_ADCCTL1_LITE_ Bits */
/* HSADC0_ADCCTL1_LITE_[INTPULSEPOS] Bits */
#define HSADC0_ADCCTL1_LITE__INTPULSEPOS_OFS     (2)                             /* !< INTPULSEPOS Offset */
#define HSADC0_ADCCTL1_LITE__INTPULSEPOS_MASK    ((uint32_t)0x00000004U)         /* !< ADC Interrupt Pulse Position. #br#
                                                                                    #br#  0  Interrupt  pulse generation
                                                                                    occurs when ADC begins conversion (at
                                                                                    the end of the acquisition window)
                                                                                    plus a number of SYSCLK cycles as
                                                                                    specified in the ADCINTCYCLE.OFFSET
                                                                                    register. #br#  1  Interrupt pulse
                                                                                    generation occurs at the end of the
                                                                                    conversion, 1 cycle prior to the ADC
                                                                                    result latching into its result
                                                                                    register */
/* HSADC0_ADCCTL1_LITE_[ADCPWDNZ] Bits */
#define HSADC0_ADCCTL1_LITE__ADCPWDNZ_OFS        (7)                             /* !< ADCPWDNZ Offset */
#define HSADC0_ADCCTL1_LITE__ADCPWDNZ_MASK       ((uint32_t)0x00000080U)         /* !< ADC Power Down (active low). This
                                                                                    bit controls the power up and power
                                                                                    down of all the analog circuitry
                                                                                    inside the analog core. #br# #br#  0
                                                                                    All analog circuitry inside the core
                                                                                    is powered down #br#  1  All analog
                                                                                    circuitry inside the core is powered
                                                                                    up */
/* HSADC0_ADCCTL1_LITE_[ADCBSYCHN] Bits */
#define HSADC0_ADCCTL1_LITE__ADCBSYCHN_OFS       (8)                             /* !< ADCBSYCHN Offset */
#define HSADC0_ADCCTL1_LITE__ADCBSYCHN_MASK      ((uint32_t)0x00000F00U)         /* !< ADC Busy Channel. Set when an ADC
                                                                                    Start of Conversion (SOC) is
                                                                                    generated. #br#When ADCBSY=0: holds
                                                                                    the value of the last converted SOC
                                                                                    #br#When ADCBSY=1: reflects the SOC
                                                                                    currently being processed #br#  0h
                                                                                    SOC0 is currently processing or was
                                                                                    last SOC converted #br#  1h  SOC1 is
                                                                                    currently processing or was last SOC
                                                                                    converted #br#  2h  SOC2 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  3h  SOC3 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  4h  SOC4 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  5h  SOC5 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  6h  SOC6 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  7h  SOC7 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  8h  SOC8 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  9h  SOC9 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ah  SOC10 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Bh  SOC11 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ch  SOC12 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Dh  SOC13 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Eh  SOC14 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Fh  SOC15 is currently
                                                                                    processing or was last SOC converted */
/* HSADC0_ADCCTL1_LITE_[ADCBSY] Bits */
#define HSADC0_ADCCTL1_LITE__ADCBSY_OFS          (13)                            /* !< ADCBSY Offset */
#define HSADC0_ADCCTL1_LITE__ADCBSY_MASK         ((uint32_t)0x00002000U)         /* !< ADC Busy. Set when ADC SOC is
                                                                                    generated, cleared by hardware four
                                                                                    ADC clocks after negative edge of S/H
                                                                                    pulse. Used by the ADC state machine
                                                                                    to determine if ADC is available to
                                                                                    sample. #br# #br#  0  ADC is
                                                                                    available to sample next channel #br#
                                                                                    1  ADC is busy and cannot sample
                                                                                    another channel */

