TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCSOC0CTL_M33_ Bits */
/* HSADC0_ADCSOC0CTL_M33_[CHSEL] Bits */
#define HSADC0_ADCSOC0CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC0CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC0 Channel Select. Selects the
                                                                                    channel to be converted when SOC0 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC0CTL_M33_[COMPEN] Bits */
#define HSADC0_ADCSOC0CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC0CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC0 Threshold comparator enable. */

/* HSADC0_ADCSOC0CTL_1 Bits */
/* HSADC0_ADCSOC0CTL_1[CHSEL] Bits */
#define HSADC0_ADCSOC0CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC0CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC0 Channel Select. Selects the
                                                                                    channel to be converted when SOC0 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC0CTL_1[COMPEN] Bits */
#define HSADC0_ADCSOC0CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC0CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC0 Threshold comparator enable. */

/* HSADC0_ADCSOC1CTL_M33_ Bits */
/* HSADC0_ADCSOC1CTL_M33_[CHSEL] Bits */
#define HSADC0_ADCSOC1CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC1CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC1 Channel Select. Selects the
                                                                                    channel to be converted when SOC1 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC1CTL_M33_[COMPEN] Bits */
#define HSADC0_ADCSOC1CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC1CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC1 Threshold comparator enable. */

/* HSADC0_ADCSOC1CTL_1 Bits */
/* HSADC0_ADCSOC1CTL_1[CHSEL] Bits */
#define HSADC0_ADCSOC1CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC1CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC1 Channel Select. Selects the
                                                                                    channel to be converted when SOC1 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC1CTL_1[COMPEN] Bits */
#define HSADC0_ADCSOC1CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC1CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC1 Threshold comparator enable. */

/* HSADC0_ADCSOC2CTL_M33_ Bits */
/* HSADC0_ADCSOC2CTL_M33_[CHSEL] Bits */
#define HSADC0_ADCSOC2CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC2CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC2 Channel Select. Selects the
                                                                                    channel to be converted when SOC2 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC2CTL_M33_[COMPEN] Bits */
#define HSADC0_ADCSOC2CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC2CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC2 Threshold comparator enable. */

/* HSADC0_ADCSOC2CTL_1 Bits */
/* HSADC0_ADCSOC2CTL_1[CHSEL] Bits */
#define HSADC0_ADCSOC2CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC0_ADCSOC2CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC2 Channel Select. Selects the
                                                                                    channel to be converted when SOC2 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC0_ADCSOC2CTL_1[COMPEN] Bits */
#define HSADC0_ADCSOC2CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC0_ADCSOC2CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC2 Threshold comparator enable. */

