TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCEVTINTSEL_1 Bits */
/* HSADC0_ADCEVTINTSEL_1[PPB1TRIPHI] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB1TRIPHI_OFS     (0)                             /* !< PPB1TRIPHI Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB1TRIPHI_MASK    ((uint32_t)0x00000001U)         /* !< Post Processing Block 1 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB1TRIPLO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB1TRIPLO_OFS     (1)                             /* !< PPB1TRIPLO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB1TRIPLO_MASK    ((uint32_t)0x00000002U)         /* !< Post Processing Block 1 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB1ZERO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB1ZERO_OFS       (2)                             /* !< PPB1ZERO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB1ZERO_MASK      ((uint32_t)0x00000004U)         /* !< Post Processing Block 1 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB1INLIMIT] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB1INLIMIT_OFS    (3)                             /* !< PPB1INLIMIT Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB1INLIMIT_MASK   ((uint32_t)0x00000008U)         /* !< Post Processing Block 1 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB2TRIPHI] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB2TRIPHI_OFS     (4)                             /* !< PPB2TRIPHI Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB2TRIPHI_MASK    ((uint32_t)0x00000010U)         /* !< Post Processing Block 2 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB2TRIPLO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB2TRIPLO_OFS     (5)                             /* !< PPB2TRIPLO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB2TRIPLO_MASK    ((uint32_t)0x00000020U)         /* !< Post Processing Block 2 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB2ZERO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB2ZERO_OFS       (6)                             /* !< PPB2ZERO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB2ZERO_MASK      ((uint32_t)0x00000040U)         /* !< Post Processing Block 2 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB2INLIMIT] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB2INLIMIT_OFS    (7)                             /* !< PPB2INLIMIT Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB2INLIMIT_MASK   ((uint32_t)0x00000080U)         /* !< Post Processing Block 2 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB3TRIPHI] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB3TRIPHI_OFS     (8)                             /* !< PPB3TRIPHI Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB3TRIPHI_MASK    ((uint32_t)0x00000100U)         /* !< Post Processing Block 3 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB3TRIPLO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB3TRIPLO_OFS     (9)                             /* !< PPB3TRIPLO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB3TRIPLO_MASK    ((uint32_t)0x00000200U)         /* !< Post Processing Block 3 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB3ZERO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB3ZERO_OFS       (10)                            /* !< PPB3ZERO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB3ZERO_MASK      ((uint32_t)0x00000400U)         /* !< Post Processing Block 3 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB3INLIMIT] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB3INLIMIT_OFS    (11)                            /* !< PPB3INLIMIT Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB3INLIMIT_MASK   ((uint32_t)0x00000800U)         /* !< Post Processing Block 3 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB4TRIPHI] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB4TRIPHI_OFS     (12)                            /* !< PPB4TRIPHI Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB4TRIPHI_MASK    ((uint32_t)0x00001000U)         /* !< Post Processing Block 4 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB4TRIPLO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB4TRIPLO_OFS     (13)                            /* !< PPB4TRIPLO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB4TRIPLO_MASK    ((uint32_t)0x00002000U)         /* !< Post Processing Block 4 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB4ZERO] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB4ZERO_OFS       (14)                            /* !< PPB4ZERO Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB4ZERO_MASK      ((uint32_t)0x00004000U)         /* !< Post Processing Block 4 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC0_ADCEVTINTSEL_1[PPB4INLIMIT] Bits */
#define HSADC0_ADCEVTINTSEL_1_PPB4INLIMIT_OFS    (15)                            /* !< PPB4INLIMIT Offset */
#define HSADC0_ADCEVTINTSEL_1_PPB4INLIMIT_MASK   ((uint32_t)0x00008000U)         /* !< Post Processing Block 4 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */

/* HSADC0_ADCOSDETECT_HSADC12B_ Bits */
/* HSADC0_ADCOSDETECT_HSADC12B_[DETECTCFG] Bits */
#define HSADC0_ADCOSDETECT_HSADC12B__DETECTCFG_OFS (0)                             /* !< DETECTCFG Offset */
#define HSADC0_ADCOSDETECT_HSADC12B__DETECTCFG_MASK ((uint32_t)0x00000007U)         /* !< ADC Opens and Shorts Detect
                                                                                    Configuration. This bit field defines
                                                                                    the open/shorts detection circuit
                                                                                    state. #br# #br#  0h  Open/Shorts
                                                                                    detection circuit is disabled. #br#
                                                                                    1h  Open/Shorts detection circuit is
                                                                                    enabled at zero scale. #br#  2h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at full scale. #br#  3h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 5/12 scale. #br#
                                                                                    4h  Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 7/12 scale. #br#
                                                                                    5h  Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 5K pulldown
                                                                                    to VSSA. #br#  6h  Open/Shorts
                                                                                    detection circuit is enabled with a
                                                                                    (nominal) 5K pullup to VDDA. #br#  7h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 7K pulldown
                                                                                    to VSSA. */

/* HSADC0_ADCOSDETECT_1 Bits */
/* HSADC0_ADCOSDETECT_1[DETECTCFG] Bits */
#define HSADC0_ADCOSDETECT_1_DETECTCFG_OFS       (0)                             /* !< DETECTCFG Offset */
#define HSADC0_ADCOSDETECT_1_DETECTCFG_MASK      ((uint32_t)0x00000007U)         /* !< ADC Opens and Shorts Detect
                                                                                    Configuration. This bit field defines
                                                                                    the open/shorts detection circuit
                                                                                    state. #br# #br#  0h  Open/Shorts
                                                                                    detection circuit is disabled. #br#
                                                                                    1h  Open/Shorts detection circuit is
                                                                                    enabled at zero scale. #br#  2h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at full scale. #br#  3h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 5/12 scale. #br#
                                                                                    4h  Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 7/12 scale. #br#
                                                                                    5h  Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 5K pulldown
                                                                                    to VSSA. #br#  6h  Open/Shorts
                                                                                    detection circuit is enabled with a
                                                                                    (nominal) 5K pullup to VDDA. #br#  7h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 7K pulldown
                                                                                    to VSSA. */

/* HSADC0_ADCREV_HSADC12B_ Bits */
/* HSADC0_ADCREV_HSADC12B_[TYPE] Bits */
#define HSADC0_ADCREV_HSADC12B__TYPE_OFS         (0)                             /* !< TYPE Offset */
#define HSADC0_ADCREV_HSADC12B__TYPE_MASK        ((uint32_t)0x000000FFU)         /* !< ADC Type. Always set to 6 for this
                                                                                    HSADC-12b. */
/* HSADC0_ADCREV_HSADC12B_[REV] Bits */
#define HSADC0_ADCREV_HSADC12B__REV_OFS          (8)                             /* !< REV Offset */
#define HSADC0_ADCREV_HSADC12B__REV_MASK         ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC0_ADCREV_1 Bits */
/* HSADC0_ADCREV_1[TYPE] Bits */
#define HSADC0_ADCREV_1_TYPE_OFS                 (0)                             /* !< TYPE Offset */
#define HSADC0_ADCREV_1_TYPE_MASK                ((uint32_t)0x000000FFU)         /* !< ADC Type. Always set to 6 for this
                                                                                    HSADC-12b. */
/* HSADC0_ADCREV_1[REV] Bits */
#define HSADC0_ADCREV_1_REV_OFS                  (8)                             /* !< REV Offset */
#define HSADC0_ADCREV_1_REV_MASK                 ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

