TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCOFFTRIM_LITE_ Bits */
/* HSADC0_ADCOFFTRIM_LITE_[OFFTRIM] Bits */
#define HSADC0_ADCOFFTRIM_LITE__OFFTRIM_OFS      (0)                             /* !< OFFTRIM Offset */
#define HSADC0_ADCOFFTRIM_LITE__OFFTRIM_MASK     ((uint32_t)0x000000FFU)         /* !< ADC Offset Trim #br# #br#Adjusts
                                                                                    the conversion results of the
                                                                                    converter up #br#or down to account
                                                                                    for offset error in the ADC. A
                                                                                    factory trim setting will be loaded
                                                                                    during device boot. #br# #br#Offset
                                                                                    can be corrected in the range of +7
                                                                                    to -8 LSBs. Value is 16*Offset in
                                                                                    8-bit 2's complement: #br# #br#7 LSB
                                                                                    (16*7) = 112 #br#6 LSB (16*6) = 96
                                                                                    #br#5 LSB (16*5) = 80 #br#4 LSB
                                                                                    (16*4) = 64 #br#3 LSB (16*3) = 48
                                                                                    #br#2 LSB (16*2) = 32 #br#1 LSB
                                                                                    (16*1) = 16 #br#0 LSB (16*0) = 0
                                                                                    #br#-1 LSB (16*(-1)) = 240 #br#:
                                                                                    #br#: #br#-7LSB(16*(-7)) = 144 */

/* HSADC0_ADCOFFTRIM_1 Bits */
/* HSADC0_ADCOFFTRIM_1[OFFTRIM] Bits */
#define HSADC0_ADCOFFTRIM_1_OFFTRIM_OFS          (0)                             /* !< OFFTRIM Offset */
#define HSADC0_ADCOFFTRIM_1_OFFTRIM_MASK         ((uint32_t)0x000000FFU)         /* !< ADC Offset Trim #br# #br#Adjusts
                                                                                    the conversion results of the
                                                                                    converter up #br#or down to account
                                                                                    for offset error in the ADC. A
                                                                                    factory trim setting will be loaded
                                                                                    during device boot. #br# #br#Offset
                                                                                    can be corrected in the range of +7
                                                                                    to -8 LSBs. Value is 16*Offset in
                                                                                    8-bit 2's complement: #br# #br#7 LSB
                                                                                    (16*7) = 112 #br#6 LSB (16*6) = 96
                                                                                    #br#5 LSB (16*5) = 80 #br#4 LSB
                                                                                    (16*4) = 64 #br#3 LSB (16*3) = 48
                                                                                    #br#2 LSB (16*2) = 32 #br#1 LSB
                                                                                    (16*1) = 16 #br#0 LSB (16*0) = 0
                                                                                    #br#-1 LSB (16*(-1)) = 240 #br#:
                                                                                    #br#: #br#-7LSB(16*(-7)) = 144 */

/* HSADC0_ADCCONFIG_12B_ Bits */
/* HSADC0_ADCCONFIG_12B_[CONFIG] Bits */
#define HSADC0_ADCCONFIG_12B__CONFIG_OFS         (0)                             /* !< CONFIG Offset */
#define HSADC0_ADCCONFIG_12B__CONFIG_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< ADC Configuration. This bit field
                                                                                    is used for TI internal
                                                                                    testing/debugging. */

/* HSADC0_ADCCONFIG_1 Bits */
/* HSADC0_ADCCONFIG_1[CONFIG] Bits */
#define HSADC0_ADCCONFIG_1_CONFIG_OFS            (0)                             /* !< CONFIG Offset */
#define HSADC0_ADCCONFIG_1_CONFIG_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< ADC Configuration. This bit field
                                                                                    is used for TI internal
                                                                                    testing/debugging. */

/* HSADC0_ADCPPB1CONFIG_M33_ Bits */
/* HSADC0_ADCPPB1CONFIG_M33_[CBCEN] Bits */
#define HSADC0_ADCPPB1CONFIG_M33__CBCEN_OFS      (5)                             /* !< CBCEN Offset */
#define HSADC0_ADCPPB1CONFIG_M33__CBCEN_MASK     ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC0_ADCPPB1CONFIG_M33_[TWOSCOMPEN] Bits */
#define HSADC0_ADCPPB1CONFIG_M33__TWOSCOMPEN_OFS (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC0_ADCPPB1CONFIG_M33__TWOSCOMPEN_MASK ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 1 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB1RESULT register. #br# #br#  0
                                                                                    ADCPPB1RESULT = ADCRESULTx -
                                                                                    ADCPPB1OFFREF #br#  1  ADCPPB1RESULT
                                                                                    = ADCPPB1OFFREF - ADCRESULTx */

