TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCPPB3TRIPHI_1 Bits */
/* HSADC0_ADCPPB3TRIPHI_1[LIMITHI] Bits */
#define HSADC0_ADCPPB3TRIPHI_1_LIMITHI_OFS       (0)                             /* !< LIMITHI Offset */
#define HSADC0_ADCPPB3TRIPHI_1_LIMITHI_MASK      ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC0_ADCPPB3TRIPLO_LITE_ Bits */
/* HSADC0_ADCPPB3TRIPLO_LITE_[LIMITLO] Bits */
#define HSADC0_ADCPPB3TRIPLO_LITE__LIMITLO_OFS   (0)                             /* !< LIMITLO Offset */
#define HSADC0_ADCPPB3TRIPLO_LITE__LIMITLO_MASK  ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB3TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC0_ADCPPB3TRIPLO_1 Bits */
/* HSADC0_ADCPPB3TRIPLO_1[LIMITLO] Bits */
#define HSADC0_ADCPPB3TRIPLO_1_LIMITLO_OFS       (0)                             /* !< LIMITLO Offset */
#define HSADC0_ADCPPB3TRIPLO_1_LIMITLO_MASK      ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB3TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC0_ADCPPB4CONFIG_M33_ Bits */
/* HSADC0_ADCPPB4CONFIG_M33_[CBCEN] Bits */
#define HSADC0_ADCPPB4CONFIG_M33__CBCEN_OFS      (5)                             /* !< CBCEN Offset */
#define HSADC0_ADCPPB4CONFIG_M33__CBCEN_MASK     ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC0_ADCPPB4CONFIG_M33_[TWOSCOMPEN] Bits */
#define HSADC0_ADCPPB4CONFIG_M33__TWOSCOMPEN_OFS (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC0_ADCPPB4CONFIG_M33__TWOSCOMPEN_MASK ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 4 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB4RESULT register. #br# #br#  0
                                                                                    ADCPPB4RESULT = ADCRESULTx -
                                                                                    ADCPPB4OFFREF #br#  1  ADCPPB4RESULT
                                                                                    = ADCPPB4OFFREF - ADCRESULTx */

/* HSADC0_ADCPPB4CONFIG_1 Bits */
/* HSADC0_ADCPPB4CONFIG_1[CBCEN] Bits */
#define HSADC0_ADCPPB4CONFIG_1_CBCEN_OFS         (5)                             /* !< CBCEN Offset */
#define HSADC0_ADCPPB4CONFIG_1_CBCEN_MASK        ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC0_ADCPPB4CONFIG_1[TWOSCOMPEN] Bits */
#define HSADC0_ADCPPB4CONFIG_1_TWOSCOMPEN_OFS    (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC0_ADCPPB4CONFIG_1_TWOSCOMPEN_MASK   ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 4 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB4RESULT register. #br# #br#  0
                                                                                    ADCPPB4RESULT = ADCRESULTx -
                                                                                    ADCPPB4OFFREF #br#  1  ADCPPB4RESULT
                                                                                    = ADCPPB4OFFREF - ADCRESULTx */

/* HSADC0_ADCPPB4OFFCAL_LITE_ Bits */
/* HSADC0_ADCPPB4OFFCAL_LITE_[OFFCAL] Bits */
#define HSADC0_ADCPPB4OFFCAL_LITE__OFFCAL_OFS    (0)                             /* !< OFFCAL Offset */
#define HSADC0_ADCPPB4OFFCAL_LITE__OFFCAL_MASK   ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

