TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCINLTRIM4_1 Bits */
/* HSADC0_ADCINLTRIM4_1[INLTRIM127TO96] Bits */
#define HSADC0_ADCINLTRIM4_1_INLTRIM127TO96_OFS  (0)                             /* !< INLTRIM127TO96 Offset */
#define HSADC0_ADCINLTRIM4_1_INLTRIM127TO96_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 127-96.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM5_TYPE3P1_ Bits */
/* HSADC0_ADCINLTRIM5_TYPE3P1_[INLTRIM159TO128] Bits */
#define HSADC0_ADCINLTRIM5_TYPE3P1__INLTRIM159TO128_OFS (0)                             /* !< INLTRIM159TO128 Offset */
#define HSADC0_ADCINLTRIM5_TYPE3P1__INLTRIM159TO128_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 159-128.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM5_1 Bits */
/* HSADC0_ADCINLTRIM5_1[INLTRIM159TO128] Bits */
#define HSADC0_ADCINLTRIM5_1_INLTRIM159TO128_OFS (0)                             /* !< INLTRIM159TO128 Offset */
#define HSADC0_ADCINLTRIM5_1_INLTRIM159TO128_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 159-128.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM6_TYPE3P1_ Bits */
/* HSADC0_ADCINLTRIM6_TYPE3P1_[INLTRIM191TO160] Bits */
#define HSADC0_ADCINLTRIM6_TYPE3P1__INLTRIM191TO160_OFS (0)                             /* !< INLTRIM191TO160 Offset */
#define HSADC0_ADCINLTRIM6_TYPE3P1__INLTRIM191TO160_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 191-160.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCINLTRIM6_1 Bits */
/* HSADC0_ADCINLTRIM6_1[INLTRIM191TO160] Bits */
#define HSADC0_ADCINLTRIM6_1_INLTRIM191TO160_OFS (0)                             /* !< INLTRIM191TO160 Offset */
#define HSADC0_ADCINLTRIM6_1_INLTRIM191TO160_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 191-160.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC0_ADCREV2_LITE_ Bits */
/* HSADC0_ADCREV2_LITE_[WRAPPERTYPE] Bits */
#define HSADC0_ADCREV2_LITE__WRAPPERTYPE_OFS     (0)                             /* !< WRAPPERTYPE Offset */
#define HSADC0_ADCREV2_LITE__WRAPPERTYPE_MASK    ((uint32_t)0x000000FFU)         /* !< ADC Wrapper Type. Always set to 6
                                                                                    for this ADC. */
/* HSADC0_ADCREV2_LITE_[WRAPPERREV] Bits */
#define HSADC0_ADCREV2_LITE__WRAPPERREV_OFS      (8)                             /* !< WRAPPERREV Offset */
#define HSADC0_ADCREV2_LITE__WRAPPERREV_MASK     ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC0_ADCREV2_1 Bits */
/* HSADC0_ADCREV2_1[WRAPPERTYPE] Bits */
#define HSADC0_ADCREV2_1_WRAPPERTYPE_OFS         (0)                             /* !< WRAPPERTYPE Offset */
#define HSADC0_ADCREV2_1_WRAPPERTYPE_MASK        ((uint32_t)0x000000FFU)         /* !< ADC Wrapper Type. Always set to 6
                                                                                    for this ADC. */
/* HSADC0_ADCREV2_1[WRAPPERREV] Bits */
#define HSADC0_ADCREV2_1_WRAPPERREV_OFS          (8)                             /* !< WRAPPERREV Offset */
#define HSADC0_ADCREV2_1_WRAPPERREV_MASK         ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC0_ADCINLTRIMCTL_HSADC12B_ Bits */
/* HSADC0_ADCINLTRIMCTL_HSADC12B_[CALIBMODE] Bits */
#define HSADC0_ADCINLTRIMCTL_HSADC12B__CALIBMODE_OFS (0)                             /* !< CALIBMODE Offset */
#define HSADC0_ADCINLTRIMCTL_HSADC12B__CALIBMODE_MASK ((uint32_t)0x00000001U)         /* !< ADC Linearity Calibration Mode. */
/* HSADC0_ADCINLTRIMCTL_HSADC12B_[CALIBSTEP] Bits */
#define HSADC0_ADCINLTRIMCTL_HSADC12B__CALIBSTEP_OFS (1)                             /* !< CALIBSTEP Offset */
#define HSADC0_ADCINLTRIMCTL_HSADC12B__CALIBSTEP_MASK ((uint32_t)0x0000003EU)         /* !< ADC Linearity Calibration Step.
                                                                                    Defines which of the 18 steps of
                                                                                    calibration is to be executed. */
/* HSADC0_ADCINLTRIMCTL_HSADC12B_[KEY] Bits */
#define HSADC0_ADCINLTRIMCTL_HSADC12B__KEY_OFS   (16)                            /* !< KEY Offset */
#define HSADC0_ADCINLTRIMCTL_HSADC12B__KEY_MASK  ((uint32_t)0xFFFF0000U)         /* !< ADC Linearity Trim Control Write
                                                                                    Key. Any write to this register must
                                                                                    contain the value 0xA5A5 in these bit
                                                                                    locations. If a write request
                                                                                    attempts to load any other value into
                                                                                    these bits, the write for the entire
                                                                                    register is ignored. These bits
                                                                                    always read back a zero. */

/* HSADC0_ADCINLTRIMCTL_1 Bits */
/* HSADC0_ADCINLTRIMCTL_1[CALIBMODE] Bits */
#define HSADC0_ADCINLTRIMCTL_1_CALIBMODE_OFS     (0)                             /* !< CALIBMODE Offset */
#define HSADC0_ADCINLTRIMCTL_1_CALIBMODE_MASK    ((uint32_t)0x00000001U)         /* !< ADC Linearity Calibration Mode. */
/* HSADC0_ADCINLTRIMCTL_1[CALIBSTEP] Bits */
#define HSADC0_ADCINLTRIMCTL_1_CALIBSTEP_OFS     (1)                             /* !< CALIBSTEP Offset */
#define HSADC0_ADCINLTRIMCTL_1_CALIBSTEP_MASK    ((uint32_t)0x0000003EU)         /* !< ADC Linearity Calibration Step.
                                                                                    Defines which of the 18 steps of
                                                                                    calibration is to be executed. */
/* HSADC0_ADCINLTRIMCTL_1[KEY] Bits */
#define HSADC0_ADCINLTRIMCTL_1_KEY_OFS           (16)                            /* !< KEY Offset */
#define HSADC0_ADCINLTRIMCTL_1_KEY_MASK          ((uint32_t)0xFFFF0000U)         /* !< ADC Linearity Trim Control Write
                                                                                    Key. Any write to this register must
                                                                                    contain the value 0xA5A5 in these bit
                                                                                    locations. If a write request
                                                                                    attempts to load any other value into
                                                                                    these bits, the write for the entire
                                                                                    register is ignored. These bits
                                                                                    always read back a zero. */

