TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCPPB1PSUM_LITE_ Bits */
/* HSADC0_ADCPPB1PSUM_LITE_[PSUM] Bits */
#define HSADC0_ADCPPB1PSUM_LITE__PSUM_OFS        (0)                             /* !< PSUM Offset */
#define HSADC0_ADCPPB1PSUM_LITE__PSUM_MASK       ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB1RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB1
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB1RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC0_ADCPPB1PSUM_LITE_[SIGN] Bits */
#define HSADC0_ADCPPB1PSUM_LITE__SIGN_OFS        (16)                            /* !< SIGN Offset */
#define HSADC0_ADCPPB1PSUM_LITE__SIGN_MASK       ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC0_ADCPPB1PSUM_1 Bits */
/* HSADC0_ADCPPB1PSUM_1[PSUM] Bits */
#define HSADC0_ADCPPB1PSUM_1_PSUM_OFS            (0)                             /* !< PSUM Offset */
#define HSADC0_ADCPPB1PSUM_1_PSUM_MASK           ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB1RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB1
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB1RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC0_ADCPPB1PSUM_1[SIGN] Bits */
#define HSADC0_ADCPPB1PSUM_1_SIGN_OFS            (16)                            /* !< SIGN Offset */
#define HSADC0_ADCPPB1PSUM_1_SIGN_MASK           ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC0_ADCPPB1PMAX Bits */
/* HSADC0_ADCPPB1PMAX[PMAX] Bits */
#define HSADC0_ADCPPB1PMAX_PMAX_OFS              (0)                             /* !< PMAX Offset */
#define HSADC0_ADCPPB1PMAX_PMAX_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Partial Max.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB1RESULT the result replaces
                                                                                    this register if it is larger.   #br#
                                                                                    #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB1 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */
/* HSADC0_ADCPPB1PMAX[SIGN] Bits */
#define HSADC0_ADCPPB1PMAX_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC0_ADCPPB1PMAX_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

