TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc0.h
/* HSADC0_ADCSEQ4CONFIG Bits */
/* HSADC0_ADCSEQ4CONFIG[ACQPS] Bits */
#define HSADC0_ADCSEQ4CONFIG_ACQPS_OFS           (0)                             /* !< ACQPS Offset */
#define HSADC0_ADCSEQ4CONFIG_ACQPS_MASK          ((uint32_t)0x000000FFU)         /* !< SOC4 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC0_ADCSEQ4CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC0_ADCSEQ4CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC0_ADCSEQ4CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC4 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC0_ADCSEQ4CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC0_ADCSEQ4CONFIG_SAMPCAPRESETSEL_OFS (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC0_ADCSEQ4CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC4 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC0_ADCSEQ4CONFIG[SEQSTART] Bits */
#define HSADC0_ADCSEQ4CONFIG_SEQSTART_OFS        (15)                            /* !< SEQSTART Offset */
#define HSADC0_ADCSEQ4CONFIG_SEQSTART_MASK       ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ4 */
/* HSADC0_ADCSEQ4CONFIG[TRIGSEL] Bits */
#define HSADC0_ADCSEQ4CONFIG_TRIGSEL_OFS         (20)                            /* !< TRIGSEL Offset */
#define HSADC0_ADCSEQ4CONFIG_TRIGSEL_MASK        ((uint32_t)0x00700000U)         /* !< SOC4 Trigger Source Select. Along
                                                                                    with the SOC4 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC4 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC0_ADCSEQ4CONFIG[SEQSWFRC] Bits */
#define HSADC0_ADCSEQ4CONFIG_SEQSWFRC_OFS        (30)                            /* !< SEQSWFRC Offset */
#define HSADC0_ADCSEQ4CONFIG_SEQSWFRC_MASK       ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 4 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC0_ADCSEQ4CONFIG[SEQENABLE] Bits */
#define HSADC0_ADCSEQ4CONFIG_SEQENABLE_OFS       (31)                            /* !< SEQENABLE Offset */
#define HSADC0_ADCSEQ4CONFIG_SEQENABLE_MASK      ((uint32_t)0x80000000U)         /* !< SEQ4Enable #br#Indicates whether
                                                                                    the Sequence4 is enabled or not */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_hsadc0__include */

